<meta charset="utf-8">
<font size="5">
<link href="../../mainstructure/mystyle.css" rel="stylesheet" type="text/css">

<div align="justify">
  <h2 align="center">Основные характеристики
        вычислительных средств. </h2>
  <p><font face="Times New Roman, Times, serif">К основным характеристикам вычислительной
      техники относятся ее эксплуатационно-технические
                                                                      характеристики,
          такие, как быстродействие, емкость памяти, точность вычислений и др. 
        </font></p>
  <p><font face="Times New Roman, Times, serif"><strong>Быстродействие ЭВМ</strong> рассматривается
      в двух аспектах. С одной стороны, оно характеризуется
            количеством элементарных операций, выполняемых центральным процессором
            в секунду. Под элементарной операцией понимается любая простейшая
                                                                        операция
          типа сложения, пересылки, сравнения п т. д. С другой стороны, быстродействие
                                                                        ЭВМ существенно
            зависит от организации ее памяти. Время, затрачиваемое на поиск необходимой
            информации в памяти, заметно сказывается на быстродействии
                                                                        ЭВМ. 
                            </font></p>
  <p><font face="Times New Roman, Times, serif">В зависимости
              от области применения выпускаются ЭВМ с быстродействием от нескольких
            сотен
              тысяч до миллиардов операций в секунду. Для решения сложных
                                                                          задач
        возможно объединение
              нескольких ЭВМ в единый вычислительный комплекс с требуемым суммарным
            быстродействием.  </font></p>
  <p><font face="Times New Roman, Times, serif">Наряду с быстродействием часто
      пользуются понятием <strong>производительность</strong>. Если
                                                                            первое
            обусловлено, главным образом, используемой в ЭВМ системой элементов,
          то второе
                                                                            связано
            с ее
                архитектурой и разновидностями решаемых задач. Даже для одной
      ЭВМ такая характеристика, как быстродействие, не является величиной постоянной.
                                                                            В
                                                                            связи
          с
            этим различают: пиковое быстродействие, определяемое тактовой частотой
            процессора
                без учета обращения к оперативной памяти; номинальное быстродействие,
                                                                            определяемое
      с учетом времени обращения к оперативной памяти; системное быстродействие,
                                                                            определяемое
      с учетом системных издержек на организацию вычислительного процесса; эксплуатационное,
                                                                            определяемое
      с учетом характера решаемых задач (состава операций или их &quot;смеси&quot;). 
                                </font></p>
  <p><font face="Times New Roman, Times, serif"><strong>Емкость, или объем, памяти</strong> определяется
      максимальным количеством информации, которое можно разместить в памяти
      ЭВМ. Обычно емкость памяти измеряется в
                                                                            
       байтах. Как уже отмечалось, память ЭВМ подразделяется на внутреннюю и
      внешнюю. Внутренняя,
                                                                            
       или оперативная память, по своему объему у различных классов машин различна
                                                                            
       и определяется системой адресации ЭВМ. Емкость внешней памяти из-за блочной
                                                                            
       структуры и съемных конструкций накопителей практически неограниченна. 
      </font></p>
  <p><font face="Times New Roman, Times, serif"><strong>Точность вычислений</strong> зависит от
      количества разрядов, используемых для представления
       одного числа. Современные ЭВМ комплектуются 32- или 64-разрядными микропроцессорами,
                                                                            
       что вполне достаточно для обеспечения высокой точности расчетов в самых
        разнообразных
                                                                            
      
       приложениях. Однако, если этого мало, можно использовать удвоенную или
        утроенную разрядную сетку.  </font></p>
  <p><font face="Times New Roman, Times, serif"><strong>Система команд</strong> -
      это перечень команд,
       которые способен выполнить процессор ЭВМ. Система команд устанавливает,
          какие конкретно операции может выполнять процессор, сколько операндов
        требуется
                                                                            
       указать в команде, какой вид (формат) должна иметь команда для ее распознания.
                                                                            
      
      
         Количество
                                                                            
       основных разновидностей команд невелико. С их помощью ЭВМ способны выполнять
                                                                            
      
      
         операции сложения, вычитания, умножения, деления, сравнения, записи
      в память, передачи числа из регистра в регистр, преобразования из одной
        системы счисления
                                                                            
      
       в другую и т. д. При необходимости выполняется модификация команд, учитывающая
                                                                            
      
         специфику вычислений. Обычно в ЭВМ используется от десятков до сотен
      команд
       (с учетом их модификации). На современном этапе развития вычислительной
          техники используются два основных подхода при формировании системы
      команд процессора.
                                                                            
      
         С одной стороны, это традиционный подход, связанный с разработкой процессоров
                                                                            
       с полным набором команд, - архитектура CISC (Complete Instruction Set
      Computer - компьютер с полным набором команд). С другой стороны, это реализация
      в
                                                                            
       ЭВМ сокращенного набора простейших, но часто употребляемых команд, что
       позволяет упростить аппаратные средства процессора и повысить его быстродействие
       -
                                                                            
        архитектура RISC (Reduced Instruction Set Computer - компьютер с сокращенным
       набором
                                      команд).  </font></p>
  <p><font face="Times New Roman, Times, serif"><strong>Стоимость ЭВМ</strong> зависит от множества
      факторов, в частности от быстродействия, емкости памяти, системы команд
      и т. д. Большое влияние на стоимость оказывает
                                                                            
       конкретная комплектация ЭВМ и, в первую очередь, внешние устройства, входящие
                                                                            
       в состав машины. Наконец, стоимость программного обеспечения ощутимо влияет
                                                                            
       на стоимость ЭВМ. 
                                                                            
       </font></p>
  <p><font face="Times New Roman, Times, serif"><strong>Надежность ЭВМ</strong> -
      это способность машины сохранять свои свойства при заданных
       условиях эксплуатации в течение определенного промежутка времени. Количественной
                                                                            
       оценкой надежности ЭВМ, содержащей элементы, отказ которых приводит к
        отказу всей машины, могут служить следующие показатели: 
                                                                            
         </font></p>
</div>
<ul>
  <li>
    <div align="justify"><font face="Times New Roman, Times, serif"> вероятность безотказной работы
            за определенное время при данных условиях
            
         эксплуатации;</font></div>
  </li>
  <li>
    <div align="justify"><font face="Times New Roman, Times, serif">наработка ЭВМ на отказ;
                                                                                  
     </font></div>
  </li>
  <li>
    <div align="justify"><font face="Times New Roman, Times, serif">среднее время восстановления
            машины и др.  </font></div>
  </li>
</ul>
<div align="justify">
  <p><font face="Times New Roman, Times, serif">Для более сложных структур типа
        вычислительного комплекса или системы понятие
                                                                            
       &quot;отказ&quot; не имеет смысла. В таких системах отказы отдельных элементов приводят
                                                                            
      
      
        
        
          
           к некоторому снижению эффективности функционирования, а не к полной
            потере
             работоспособности в целом.  </font></p>
  <p><font face="Times New Roman, Times, serif">Важное значение имеют и другие
      характеристики
      
                 вычислительной техники, например: <strong>универсальность, программная
      совместимость, вес, габариты, энергопотребление</strong>    и др. Они принимаются во внимание при оценивании конкретных сфер применения ЭВМ. </font></p>
</div>
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="tem.php"> Назад</a></p></p>
</font>