<html>
<meta charset="utf-8">
<font size="5">
<title> Аппаратная совместимость. </title>
<h3 align="center">Аппаратная совместимостиь</h3>

<p align="justify">Понятие <b>«аппаратная платформа»</b> связано с решением фирмы IBM о выработке и утверждении единого стандарта на основные комплектующие персонального компьютера. До этого времени фирмы-производители ПК стремились создать собственные, уникальные устройства, чтобы стать монополистом по сборке и обслуживанию собственных персональных компьютеров. Однако в итоге рынок был перенасыщен несовместимыми друг с другом ПК, для каждого из которых нужно было создавать собственное программное обеспечение. В этот период устройство Однако при этом фирма IBM быстро лишилась приоритета на рынке средств вычислительной техники, так как конкуренты производили клоны дешевле оригинального IBM PC. Но стандарт прижился как <i>платформа IBM PC-совместимых ПК. </i></p><noindex><center><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
<ins class="adsbygoogle"
     style="display:block; text-align:center;"
     data-ad-format="fluid"
     data-ad-layout="in-article"
     data-ad-client="ca-pub-2375543522969552"
     data-ad-slot="2372365134"></ins>
<script>
     (adsbygoogle = window.adsbygoogle || []).push({});
</script></center></noindex>
  <p align="justify">В связи с тем, что в настоящее время фирма IBM - создатель первого в мире массового персонального компьютера - утратила свой приоритет в выпуске ПК, на Западе все реже употребляют термин «IBM-совместимые компьютеры», а используют понятие «платформа Wintel», подразумевая под этим сочетание микропроцессора фирмы Intel с операционной системой Windows. Микропроцессор при этом рассматривается как основа аппаратной платформы, которая определяет архитектуру персонального компьютера, т. е. его тип и характеристики.</p>
  <p align="justify">Однако термин Wintel не совсем точно определяет понятие платформы, так как открытая архитектура современных IBM-совместимых персональных компьютеров позволяет собирать их из комплектующих, изготавливаемых различными фирмами-производителями, включая и микропроцессоры, которые в настоящее время выпускаются не только фирмой Intel, но и Advanced Micro Devices (AMD), Cyrix Corp. и др. Кроме того, IBM-совместимые ПК могут работать не только под управлением операционной системы Windows, но и под управлением других операционных систем.</p>
  <p align="justify">Кроме платформы IBM-совместимых ПК в настоящее время достаточно широкое распространение получила платформа Apple, представленная довольно популярными на Западе компьютерами Macintosh. Специалисты по компьютерной истории отдают приоритет в создании ПК именно компании Apple. С середины 70-х г. эта фирма предста­вила несколько десятков моделей ПК - начиная с Apple I и заканчивая современным iMac, - и уверенно противостояла мощной корпорации IBM. В середине 80-х гг. компьютеры серии Macintosh стали самыми популярными ПК в мире. В отличие от IBM, компания Apple всегда делала ставку на закрытую архитектуру - комплектующие и программы для этих компьютеров выпускались лишь небольшим числом «авторизированных» производителей. За счет этого компьютеры Macintosh всегда стоили несколько дороже своих IBM-совместимых ПК, что компенсировалось их высокой надежностью и удобством. Именно на компьютерах Apple впервые появились многие новинки, со временем ставшие неотъемлемой частью персонального компьютера: графический интерфейс и мышь, звуковая подсистема и компьютерное видео и т. д. Кроме того, и интерфейс самой Windows был частично скопирован с одной из ранних операционных систем Apple, созданной для компьютера Lisa.</p>
  <p align="justify">Работа с графикой и сегодня остается основной областью функционирования персональных компьютеров Apple. Поэтому ПК Macintosh по-прежнему незаменимы в таких областях, как издательское дело, подготовка и дизайн полноцветных иллюстраций, аудио- и видеообработка. В этом качестве компьютеры Apple используются сейчас в России (в США новые модели Apple используются и в качестве домашних ПК). Сегодня на рынке средств вычислительной техники представлено несколько основных платформ персональных компьютеров, каждая из которых отличается как по назначению, так и по типу аппаратного и программного обеспечения. Как правило, различные платформы компьютеров несовместимы между собой. Проблема совместимости компьютерных платформ возникла практически одновременно с появлением самих персональных компьютеров. По тем или иным причинам каждый производитель делал свою продукцию оригинальной настолько, что более никто не мог обменяться с ней информацией. В какой-то степени эта конкурентная борьба продолжается и в настоящее время, однако понимание того, что в погоне за клиентом основополагающим фактором должна стать универсальность, пришло к производителям компьютерных систем уже очень давно.</p><br>


<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.5.php"> Назад</a></p></p>
</font>
</html>