<html>
<meta charset="utf-8">
<font size="5">
<title> Аппаратная и программная поддержка работы периферийных устройств контроллеры, адаптеры, мосты, прямой доступ к памяти, приостановки, прерывания, драйверы. </title>
<h3 align="center">Аппаратная и программная поддержка работы периферийных устройств контроллеры, адаптеры, мосты, прямой доступ к памяти, приостановки, прерывания, драйверы</h3>
















<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="2.1.php"> Вернуться к темам</a> </br></br>
<a href="vnesh.php"> Назад</a></p></p>
</font>
</html>