<html>
<meta charset="utf-8">
<font size="5">
<title> Центральный процессов ЭВМ. </title>
<h3 align="center">Центральный процессов ЭВМ.</h3>
<p align="justify"> <B>Центральный процессор </B>- это центральное устройство компьютера, которое выполняет операции по обработке данных и управляет периферийными устройствами компьютера. У компьютеров четвёртого поколения и старше функции центрального процессора выполняет микропроцессор на основе СБИС, содержащей несколько миллионов элементов, конструктивно созданный на полупроводниковом кристалле путём применения сложной микроэлектронной технологии.
</span></span></P>

<P align=justify class="стиль4">В состав центрального процессора входят:</P>

<UL class="стиль4">
<LI><B>устройство управления</B> <B>(УУ);</B> 
<LI><B>арифметико-логическое устройство</B> <B>(АЛУ);</B> 
<LI><B>запоминающее устройство</B> <B>(ЗУ) на основе регистров процессорной памяти и кэш-памяти процессора;</B> 
<LI><B>генератор тактовой частоты (ГТЧ)</B>.<br>
    <br>
      <B>Устройство управления</B> организует процесс выполнения программ и координирует взаимодействие всех устройств ЭВМ во время её работы.</LI></UL>
<P align=justify class="стиль4"><B>Арифметико-логическое устройство</B> выполняет арифметические и логические операции над данными: сложение, вычитание, умножение, деление, сравнение и др.</P>

<P align=justify class="стиль4"><B>Запоминающее устройство</B> - это внутренняя память процессора. <B>Регистры</B> служит промежуточной быстрой памятью, используя которые, процессор выполняет расчёты и сохраняет промежуточные результаты. Для ускорения работы с оперативной памятью используется <B>кэш-память,</B> в которую с опережением подкачиваются команды и данные из оперативной памяти, необходимые процессору для последующих операций.</P>

<P align=justify class="стиль4"><B>Генератор тактовой частоты </B>генерирует электрические импульсы, синхронизирующие работу всех узлов компьютера. В ритме ГТЧ работает центральный процессор. </P>

<P align=justify class="стиль4">К основным характеристикам процессора относятся:</P>

<p align="justify"><LI><B>Быстродействие</B> (вычислительная мощность) – это среднее число операций процессора в секунду. </p>
<p align="justify"><LI><B>Тактовая частота</B> в МГц. Тактовая равна количеству тактов в секунду. <B>Такт</B> <B>-</B> это промежуток времени между началом подачи текущего импульса ГТЧ и началом подачи следующего. Характерные тактовые частоты микропроцессоров: 40 МГц, 66 МГц, 100 МГц, 130 МГц, 166 МГц, 200 МГц, 333 МГц, 400 МГц, 600 МГц, 800 МГц, 1000 МГц и т. д. До 3ГГц Тактовая частота отражает уровень промышленной технологии, по которой изготавливался данный процессор. Она также характеризирует и компьютер, поэтому по названию модели микропроцессора можно составить достаточно полное представление о том, к какому классу принадлежит компьютер. Поэтому часто компьютерам дают имена микропроцессоров, входящих в их состав. Ниже приведены названия наиболее массовых процессоров, выпущенных фирмой Intel и годы их создания: 8080 (1974 г.), 80286 (1982 г.), 80386DX (1985 г.), 80486DX (1989 г.), 80586 или Pentium (1993 г.), Pentium Pro (1995 г.), Pentium II (1997 г.), Pentium III (1999 г.), Pentium IV (2001 г.). Как видно, увеличение частоты – одна из основных тенденций развития микропроцессоров. На рынке массовых компьютеров лидирующее место среди производителей процессоров занимают 2 фирмы: Intel и AMD. За ними закрепилось базовое название, переходящее от модели к модели. У Intel – это Pentium и модель с урезанной кэш-памятью Pentium Celeron; у AMD – это Athlon и модель с урезанной кэш-памятью Duron. </p>
<p align="justify"><LI><B>Разрядность процессора</B> - это максимальное количество бит информации, которые могут обрабатываться и передаваться процессором одновременно. Разрядность процессора определяется разрядностью регистров, в которые помещаются обрабатываемые данные. Например, если регистр имеет разрядность 2 байта, то разрядность процессора равна 16 (2x8); если 4 байта, то 32; если 8 байтов, то 64. </LI></UL></p>

<p align="justify">Для пользователей процессор интересен прежде всего своей системой команд и скоростью их выполнения. Система команд процессора представляет собой набор отдельных операций, которые может выполнить процессор данного типа. Разные модели микропроцессоров выполняют одни и те же операции за разное число тактов. Чем выше модель микропроцессора, тем, как правило, меньше тактов требуется для выполнения одних и тех же операций.</P>

<P align=justify class="стиль4">Для математических вычислений к основному микропроцессору добавляют математический сопроцессор. Начиная с модели 80486DX процессор и сопроцессор выполняют на одном кристалле.</P>
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="2.1tem.php"> Назад</a></p></p>
</font>
</html>