<html>
<meta charset="utf-8">
<font size="5">
<title> Дисковые интерфейсы. </title>
<h3 align="center">Дисковые интерфейсы.</h3>
<p><a href="disc-kontroller.jpg"><span itemprop="image" itemscope itemtype="https://schema.org/ImageObject"><img itemprop="url image" itemprop="image" class="aligncenter wp-image-51 colorbox-49" src="disc-kontroller.jpg" alt="Дисковые контроллеры" width="600" height="414" /><meta itemprop="width" content="600"><meta itemprop="height" content="414"></span></a></p>
<p><strong>Дисковые контроллеры</strong> &#8212; предназначены для работы с такими устройствами, как жесткие диски, оптический приводы и флоппи дисководы.<span id="more-49"></span></p>
<p>Дополнительно к контроллерам, материнские платы оборудованы интерфейсами, для непосредственного подключения этих устройств к материнской плате.</p>
<h3>Интерфейсы</h3>
<p><strong>Интерфейс</strong> &#8212; это способ подключения устройства. Он определяет, каким образом устройства будут обмениваться данными. Так же от интерфейса зависит внешний вид разъема для подключения устройства.</p>
<p><strong>SATA,IDE, FDD(Floppy)</strong></p>
<p><em>SATA,IDE</em> &#8212; для жестких дисков и оптических приводов</p>
<p>SATA и IDE несовместимы друг с другом (IDE &#8212; старый интерфейс; SATA &#8212; новый и более быстрый)</p>
<p><em>FDD</em> &#8212; для флоппи-дисководов</p>
<h3>SATA интерфейс</h3>
<p><a href="sata-interface.jpg"><span itemprop="image" itemscope itemtype="https://schema.org/ImageObject"><img itemprop="url image" itemprop="image" class="aligncenter wp-image-52 colorbox-49" src="sata-interface.jpg" alt="SATA интерфейс" width="600" height="275" /><meta itemprop="width" content="600"><meta itemprop="height" content="275"></span></a></p>
<p><strong>SATA (Serial ATA)</strong> &#8212; последовательный интерфейс обмена данными с накопителями информации.</p>
<p>Сам разъем представляет собой, контактную площадку с ключом в виде перевернутой буквы &#171;Г&#187;, для правильно подключения SATA кабеля. В этом разъеме 7 контактов, и вокруг контактной площадки расположена защитная окантовка для фиксации кабеля в разъеме.</p>
<p>Для того чтобы понять какие разъемы установлены на материнской плате (возле каждого разъема есть маркировка ,которая указывает на тип разъема и его номер, и также разные по скорости разъемы сделаны разным цветом).</p>
<p><strong>Типы разъемов SATA:</strong></p>
<ol>
<li>SATA 1 (SATA 150) &#8212; до 150МБ/с (1,5Гбит/с)</li>
<li>SATA 2 (SATA 150) &#8212; до 300МБ/с (3,0Гбит/с)</li>
<li>SATA 3 (SATA 600) &#8212; до 600МБ/с (6,0Гбит/с)</li>
<li>eSATA</li>
</ol>
<p>SATA 1, SATA 2, SATA 3 &#8212; Предназначены для подключения внутри системного блока (по внешнему виду они не отличаются, а отличие только в максимальной скорости работы).</p>
<p>eSATA &#8212; для подключения внешних устройств.</p>
<h3>IDE интерфейс</h3>
<p><a href="IDE-interface.jpg"><span itemprop="image" itemscope itemtype="https://schema.org/ImageObject"><img itemprop="url image" itemprop="image" class="aligncenter wp-image-53 colorbox-49" src="IDE-interface.jpg" alt="IDE интерфейс" width="600" height="312" /><meta itemprop="width" content="600"><meta itemprop="height" content="312"></span></a></p>
<p><strong>IDE</strong> &#8212; параллельный интерфейс подключения накопителей к компьютеру. Другие название ATA,PATA (Parallel ATA), UltraDMA.</p>
<p>Разъем представляет собой, два ряда контактов (контактов 40 штук) и в качестве ключа, для правильного подключения кабеля выступает &#171;Отсутствующий по центру контакт и вырез на пластиковой стенке разъема&#187;.</p>
<p>На современных материнских платах этот разъем работает с максимальной скоростью в 133 МБайта/с. Поэтому есть еще одно название &#8212; ATA 133.</p>
<p>На разъем можно подключать одно или два устройства, и возле разъема на материнской плате обычно есть маркировка &#8212; которая указывает тип разъема.</p>
<h3>FDD интерфейс</h3>
<p><a href="FFD-interface.jpg"><span itemprop="image" itemscope itemtype="https://schema.org/ImageObject"><img itemprop="url image" itemprop="image" class="aligncenter wp-image-54 colorbox-49" src="FFD-interface.jpg" alt="FDD интерфейс" width="600" height="311" /><meta itemprop="width" content="600"><meta itemprop="height" content="311"></span></a></p>
<p><strong>FDD</strong> &#8212; для для подключения флоппи-дисководов. Это самый первый интерфейс для подключения накопителей в компьютер, и в новых материнских платах он уже не используется.</p>
<p>Разъем имеет 34 контакта, внешне похож на разъем IDE, но меньше по размеру. В качестве ключа для правильно подключения используется &#171;Отсутствующий с одной стороны контакт и вырез на пластиковой стенке разъема&#187;.</p>
<p>Разъемы IDE и FDD для современного компьютера не нужны т.к они не могут обеспечить максимальной скорости работы, но на платах они еще встречаются. И это связано с тем, что производители материнских плат, устанавливают эти разъемы для пользователей, которые работаю со старым оборудованием.</p>
<h3>RAID &#8212; массив</h3>
<p><strong>RAID</strong> &#8212; массив из нескольких дисков, воспринимаемых как единое целое.</p>
<p>Применяются для увеличения скорости работы с дисками, повышения надежности хранения данных, а также для объединения нескольких дисков в один большой диск.</p>
<p>Распространённые типы RAID-массивов:</p>
<ul>
<li>RAID 0</li>
<li>RAID 1</li>
<li>RAID 5</li>
<li>RAID 10</li>
</ul>
<p>В большинстве домашних ПК, RAID массивы не используются. Поскольку требуют определенных технических знаний, навыков и при этом стоимость компьютера может увеличиться до 20%.</p>
<p>Эффект от использования RAID-массивов будет заметен только при большой работе с файлами, или если необходимо надёжно хранить какие-то важные данные.</p>
<p>Давайте рассмотрим несколько примеров RAID-массивов, чтобы вы понимали как они работают и для чего их можно использовать.</p>
<p><strong>RAID 0 (чередование или зебра)</strong></p>
<p><a hrefraid0.jpg"><span itemprop="image" itemscope itemtype="https://schema.org/ImageObject"><img itemprop="url image" itemprop="image" class="aligncenter wp-image-55 colorbox-49" src="raid0.jpg" alt="RAID 0 (чередование или зебра)" width="600" height="299" /><meta itemprop="width" content="600"><meta itemprop="height" content="299"></span></a></p>
<p>Для примера возьмем 2 жестких диска размером 300ГБайт. В компьютер ставится два одинаковых жестких диска, и RAID-массив настроен таким образом, что физические диски объединяются в один логический диск.</p>
<p>То есть система будет видеть один диск, объем которого равен сумме всех дисков в RAID-массиве: 300ГБайт + 300ГБайт = 600ГБайт.</p>
<p>В этом массиве, данные пишутся по очереди на каждый диск и получается (чередование или зебра), часть файла пишется на первый диск, другая часть на второй.</p>
<p>За счет такого чередования повышается скорость чтения и записи информации на диски, и производительность возрастает на столько &#8212; сколько используется дисков в RAID-массиве.</p>
<p>Минус использования такого RAID-массива заключается в том, что снижается надежность хранения данных. Это связано с тем, что файл разбит на части (части хранятся на разных дисках), и если какой-то из дисков выйдет из стоя, то информацию будет сложно восстановить или даже невозможно.</p>
<p><strong>RAID 1 (зеркало)</strong></p>
<p><a href="raid1.jpg"><span itemprop="image" itemscope itemtype="https://schema.org/ImageObject"><img itemprop="url image" itemprop="image" class="aligncenter wp-image-56 colorbox-49" src="raid1.jpg" alt="RAID 1 (зеркало)" width="600" height="282" /><meta itemprop="width" content="600"><meta itemprop="height" content="282"></span></a></p>
<p>В ПК ставится несколько одинаковых жестких дисков (в нашем случае 2 диска размером 300ГБайт). И система будет видеть один логический диск, причем его объём будет 300ГБайт.</p>
<p>Массив настроен таким образом ,что на дисках хранятся одинаковые данные т.е диск #2 отражает информацию с диска #1 и является его зеркалом.</p>
<p>При этом повышается скорость чтения, и надёжность хранения данных (если выйдет из строя диск #1, то вся информация будет находиться на диске #2).</p>
<p>Минус такого массива в том, что мы платим за несколько дисков одного объёма, а получаем один.</p>


<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.3.php"> Назад</a></p></p>
</font>
</html>