

<html>
<meta charset="utf-8">
<font size="5">
<title> Экономия электроэнергии. </title>
<h3 align="center">Экономия электроэнергии.</h3>


<p style="text-align: justify;"><strong>Управление электропитанием</strong><br /> Активизация настроек управления электропитанием
вашего ПК позволяет сэкономить электроэнергию и деньги. Режим ожидания и спящий режим - два простых способа сделать домашний компьютер энергоэффективным. Режим ожидания - отличный вариант, когда вы часто и ненадолго отходите от рабочей станции. Экономия достигается за счет отключения питания от монитора, жесткого диска и иных компонентов. При нажатии на любую клавишу или перемещении мыши компьютер возобновит работу. Однако если в режиме ожидания возникнет перебой с электропитанием, несохраненные данные могут
быть потеряны. Поэтому рекомендуется использовать ИБП. При истощении заряда батареи специальное ПО сохранит данные и выключит компьютер. Для ноутбука активизация режима ожидания - наиболее эффективный способ сэкономить заряд аккумулятора.</p><p style="text-align: justify;">Спящий режим (гибернация) наиболее оптимален, когда вы отходите от ПК на продолжительное время. В этом случае данные копируются в резервную область диска, а компьютер выключается. Это позволяет уменьшить энергопотребление при сохраненных данных,
а также снизить износ компонентов компьютерной системы. После включения ПК все документы, фильмы, игры появятся на экране в том виде, какими вы их оставили. Для ноутбука имеет смысл настроить автоматический переход в спящий режим, когда уровень заряда батареи близок к критическому. В качестве примера ниже описано, как активизировать настройки управления электропитанием и режим ожидания для домашнего ПК с операционной системой Windows ХР Professional.</p><p style="text-align: justify;"><strong>1.</strong> В меню
<strong>&quot;Пуск&quot;</strong> выбираем <strong>Настройка</strong>, <strong>Панель управления</strong>.<br /> <strong>2.</strong> В открывшемся окне среди множества других категорий выбираем <strong>Электропитание</strong>.<br /> <strong>3.</strong> В окне <strong>&quot;Свойства: Электропитание&quot;</strong> необходимо выбрать схему управления электропитанием <strong>Домашний/Настольный</strong>.<br /> <strong>4.</strong> Для полей: <strong>Отключение дисплея</strong> и <strong>Отключение дисков</strong>
установите значение &quot;15 минут&quot; или меньше, а для поля: <strong>Ждущий режим через</strong> - &quot;30 минут&quot; или меньше. Нажмите на кнопку <strong>&quot;ОК&quot;</strong>.</p><p style="text-align: justify;"><strong>Советы для бережливых</strong><br /> Мы подготовили несколько советов, которые помогут вам сэкономить электроэнергию и деньги при использовании домашнего ПК (и не только).<br /> <strong>1.</strong> Работая за компьютером 8 ч в сутки и выключая его на ночь, вы сократите годовое энергопотребление
в среднем на 500 кВт*ч и сэкономите до 67% на оплате электроэнергии.<br /> <strong>2.</strong> Приобретайте компьютеры, соответствующие международному стандарту Energy Star для энергоэффективных потребительских товаров. Не забывайте, что ноутбуки потребляют значительно меньше электроэнергии, чем настольные ПК.<br /> <strong>3.</strong> Планируйте работу с компьютером так, чтобы сделать все необходимое за один раз. Все остальное время домашний компьютер должен быть выключен.<br /> <strong>4.</strong> При покупке
монитора примите в расчет диагональ: так, 14-дюймовый монитор потребляет на 40% меньше энергии, чем его &quot;старший брат&quot; с диагональю 17 дюймов.<br /> <strong>5.</strong> Активизируйте режим ожидания и настройте управление электропитанием вашего ПК.<br /> <strong>6.</strong> Если завершать работу запущенных прикладных программ нежелательно, используйте функцию гибернации. Она позволит выключить компьютер, а впоследствии возобновить работу с программами с момента выключения.<br /> <strong>7.</strong>
Откажитесь от использования режима экранной заставки. Гораздо лучше по завершении работы просто выключить компьютер. В немалой степени это относится и к периферийной технике.<br /> <strong>8.</strong> При покупке принтеров лучше отдавать предпочтение &quot;струйникам&quot;. Хотя они печатают медленнее, чем лазерные принтеры, зато энергии потребляют на 80-90% меньше.<br /> <strong>9.</strong> Снижайте яркость монитора до разумных пределов - это экономит энергию. Кроме того, работая за компьютером, уменьшайте
уровень внешнего освещения.<br /> <strong>10.</strong> Везде, где это возможно, присоединяйте периферииную технику к сети и используйте ее коллективно.</p>

















<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.6.php"> Назад</a></p></p>
</font>
</html>