<html>
<meta charset="utf-8">
<font size="5">
<title> Накопитель на жестком магнитном диске. </title>
<h3 align="center">Накопитель на жестком магнитном диске.</h3>


<p align="justify">Накопитель на жестком диске многим кажется самым необходимым и в то же время загадочным компонентом компьютерной системы. Как известно, он предназначен для долгосрочного хранения данных, и последствия его выхода из строя зачастую оказываются катастрофическими. Предполагается, что данные на жестком диске будут храниться до тех пор, пока сам пользователь их не сотрет или не перепишет. Для правильной эксплуатации или модернизации компьютера необходимо хорошо себе представлять, что же это такое — накопитель на жестком диске.</p>
<p align="justify">Основными элементами накопителя являются несколько круглых алюминиевых или некристаллических стекловидных пластин. В отличие от гибких дисков (дискет) их нельзя согнуть; отсюда и появилось название жесткий диск (см. рисунок). В большинстве устройств они несъемные, поэтому иногда такие накопители называются фиксированными (fixed disk). Существуют также накопители со сменными дисками.</p>
<p align="justify">&nbsp;</p>
<p align="justify">
<img alt="Устройство жёсткого диска" border="0" src="330.jpg"></p>
<p align="justify">
<strong><span style="text-decoration: underline;"><em>Примечание!</em></span></strong></p>
<address>
<p align="justify"><span style="color:#0000ff;"><span style="background-color:#ffffff;">Накопители на жестких дисках обычно называют винчестерами. Этот термин появился в 1960-х годах, когда компания IBM выпустила высокоскоростной накопитель с одним несъемным и одним съемным дисками емкостью по 30 Мбайт. Этот накопитель состоял из пластин, которые вращались с высокой скоростью, и ‘‘парящих’’ над ними головок, а номер его разработки&nbsp;— 30-30. Такое цифровое обозначение совпало с обозначением популярного нарезного оружия Winchester, поэтому термин винчестер вскоре стал применяться в отношении любого стационарно закрепленного жесткого диска. Это типичный профессиональный жаргон; на самом деле подобные устройства не имеют с обычными винчестерами (т.е. с оружием) ничего общего.</span></span></address></p>
<div class="item-separator"></div>
</div>
</div>
<div class="items-row cols-1 row-0">
<div class="item column-1">
<h2>

Формфакторы
</h2>

<p align="justify">Одним из краеугольных камней индустрии ПК была стандартизация; физические и электрические характеристики жестких дисков — тому свидетельство. Благодаря промышленным стандартам можно приобрести корпус (или систему) у одного производителя и установить в него накопитель от другого и при этом быть уверенным, что накопитель войдет в отсек, шурупы совпадут с предназначенными для них отверстиями, а кабели подойдут к разъемам. Промышленные стандарты обеспечивают взаимную совместимость различных корпусов, системных плат, кабелей и накопителей.</p>
<p align="justify">Интересно проследить историю принятия стандартных форм и размеров. В некоторых случаях один производитель создавал накопитель общепринятой формы, поддерживающий популярный протокол обмена данными, в то время как другие копировали или клонировали параметры этого накопителя, создавая продукты, физически или электрически совместимые с оригиналом. Но бывало и так, что различные комитеты или группы формировались для утверждения определенных промышленных стандартов, после чего всем компаниям предлагалось создавать продукты, им соответствующие.</p>
<p align="justify">С течением времени появилось несколько стандартных типов жестких дисков, обычно различающихся размером пластин. В таблице представлены типы жестких дисков, применявшихся в настольных и портативных компьютерах.</p>
<p align="justify"></p>
<p align="justify"><img src="331.jpg" border="0" alt="Формы и размеры жестких дисков"></p>
<p align="justify">На данный момент в настольных компьютерах используются накопители шириной 3,5 дюйма, а в портативных — 2,5 дюйма и меньше. На смену накопителям формфактора 3,5 дюйма с интерфейсом Parallel <a class="sitelinkx" href="/ataide/763-podrobno-o-standartakh" title="ATA/IDE"><a class="sitelinkx" href="/ataide/763-podrobno-o-standartakh" title="ATA">ATA</a></a> быстро приходят накопители с интерфейсом Serial ATA, которым оснащены все современные компьютеры. В то же время ноутбуки, в которых используются жесткие диски с интерфейсом Serial ATA, стали появляться на рынке относительно недавно. Это связано с тем, что количество наборов микросхем для ноутбуков, поддерживающих интерфейс SATA, крайне ограничено; подавляющее их большинство ограничивается поддержкой интерфейса PATA. При этом поддержка SATA часто была реализована с помощью дополнительного контроллера, интегрированного на системной плате, что отрицательно сказывалось как на цене, так и на энергопотреблении ноутбука. И только наборы микросхем серии 900 от компании Intel обзавелись SATA, а накопители SATA формфактора 2,5 дюйма доступны на рынке.</p><br><br>
<div class="item-separator"></div>
</div>
<span class="row-separator"></span>
</div>
<div class="items-row cols-1 row-1">
<div class="item column-1">
<h2>

Принципы работы накопителей на жестких дисках
</h2>

<p align="justify">В накопителях на жестких дисках данные записываются и считываются универсальными головками чтения/записи с концентрических окружностей вращающихся магнитных дисков (дорожек), разбитых на секторы емкостью 512 байт (см. рисунок).</p>
<p align="justify"></p>
<p align="justify"><img src="332.jpg" border="0" alt="Дорожки и секторы накопителя на жестких дисках"></p>
<p align="justify">В накопителях обычно устанавливается несколько дисковых пластин и данные записываются на обеих сторонах каждой из них. В большинстве накопителей есть по меньшей мере два или три диска (что позволяет выполнять запись на четырех или шести сторонах), но существуют также устройства, содержащие до 11 и более дисков. Однотипные (одинаково расположенные) дорожки на всех сторонах дисков объединяются в цилиндр (см. рисунок ниже). Для каждой стороны диска предусмотрена своя дорожка чтения/записи, но при этом все головки смонтированы на общем стержне, или приводе. Поэтому головки не могут перемещаться независимо друг от друга, т.е. двигаются только синхронно.</p>
<p align="justify">Жесткие диски вращаются намного быстрее, чем гибкие. Частота их вращения даже в большинстве первых моделей составляла 3600 об/мин (т.е. в 10 раз больше, чем в накопителе на гибких дисках) и до последнего времени была почти стандартом для жестких дисков. Но в настоящее время частота вращения жестких дисков возросла. Несмотря на то что скорость вращения может изменяться, современные устройства раскручивают пластины до 4200, 5400, 7200, 10000 и даже 15000 об/мин. Некоторые диски малых формфакторов с целью экономии электроэнергии раскручиваются всего до 4200 об/мин, в то время как высокоскоростные можно встретить в основном в рабочих станциях и серверах, где повышенная цена, а также дополнительный шум и тепловыделение не играют решающей роли. Высокая скорость вращения в сочетании со скоростным механизмом подачи головок и большим количеством секторов на дорожке — вот главные факторы, определяющие общую производительность жесткого диска.</p>
<p align="justify">При нормальной работе жесткого диска головки чтения/записи не касаются (и не должны касаться!) дисков. Но при выключении питания и остановке дисков они опускаются на поверхность. Во время работы устройства между головкой и поверхностью вращающегося диска образуется очень малый воздушный зазор (воздушная подушка). Если в этот зазор попадет пылинка или произойдет сотрясение, головка “столкнется” с диском, вращающимся “на полном ходу”. Если удар будет достаточно сильным, произойдет поломка головки. Последствия этого могут быть разными — от потери нескольких байтов данных до выхода из строя всего накопителя. Поэтому в большинстве накопителей поверхности магнитных дисков легируют и покрывают специальными смазками, что позволяет устройствам выдерживать ежедневные “взлеты” и “приземления” головок, а также более серьезные потрясения.</p>
<p align="justify"></p>
<p align="justify"><img src="333.jpg" border="0" alt="Цилиндр накопителя на жестких дисках"></p>
<p align="justify">В некоторых современных накопителях вместо конструкции CSS (Contact Start Stop) используется механизм загрузки/разгрузки, который не позволяет головкам входить в контакт с жесткими дисками даже при отключении питания накопителя. Этот механизм впервые был использован в 2,5-дюймовых накопителях портативных компьютеров, для которых устойчивость к механическим воздействиям играет весьма важную роль. В механизме загрузки/разгрузки используется наклонная панель, расположенная непосредственно над внешней поверхностью жесткого диска. Когда накопитель выключен или находится в режиме экономии потребляемой мощности, головки съезжают на эту панель. При подаче электроэнергии головки разблокируются только тогда, когда скорость вращения жестких дисков достигнет нужной величины. Поток воздуха, создаваемый при вращении дисков (аэростатический подшипник), позволяет избежать возможного контакта между головкой и поверхностью жесткого диска.</p>
<p align="justify">Поскольку пакеты магнитных дисков содержатся в плотно закрытых корпусах и их ремонт не предусмотрен, плотность дорожек на них очень высока — до 96000 и более на дюйм (Hitachi Travelstar 80GH). Блоки HDA (Head Disk Assembly — блок головок и дисков) собирают в специальных цехах в условиях практически полной стерильности. Обслуживанием HDA занимаются считанные фирмы, поэтому ремонт или замена каких-либо деталей внутри герметичного блока HDA обходится очень дорого. Вам придется смириться с мыслью, что рано или поздно накопитель выйдет из строя, и вопрос только в том, когда это произойдет и успеете ли вы сохранить свои данные.</p>
<p align="justify"><strong><span style="text-decoration: underline;"><em>Внимание!</em></span></strong></p>
<p align="justify"><address>Вскрывать накопитель на жестких дисках в домашних условиях не рекомендуется. Некоторые производители накопителей конструктивно выполняют их таким образом, что при вскрытии обрывается защитная лента. Самостоятельно вскрыв накопитель, вы тем самым разрываете эту защитную ленту и лишаетесь гарантийных обязательств производителя. </address>
<p align="justify">Многие пользователи считают накопители на жестких дисках самыми хрупкими и ненадежными узлами компьютеров, и, вообще говоря, они правы. Однако во время проводимых мною семинаров по аппаратному обеспечению компьютеров и проблемам восстановления данных накопители практически постоянно работали со снятыми крышками. Иногда приходилось даже снимать и устанавливать на место крышки работающих накопителей, и несмотря на это они по сей день продолжают успешно работать и с крышками, и без них. Разумеется, я не советую вам делать то же самое со своими устройствами.</p>
<p align="justify"></p>
<div class="item-separator"></div>
</div>
<span class="row-separator"></span>
</div>
<div class="items-row cols-1 row-2">
<div class="item column-1">
<h2>

Основные компоненты жестких дисков
</h2>

<p align="justify">Существует множество типов накопителей на жестких дисках, но практически все они состоят из одних и тех же основных узлов. Конструкции этих узлов, а также качество используемых материалов могут различаться, но их основные рабочие характеристики и принципы функционирования одинаковы. Основные элементы конструкции типичного накопителя на жестком диске (см. рисунок ниже) перечислены ниже:</p>
<ul>
<li>диски;</li>
<li>головки чтения/записи;</li>
<li>механизм привода головок;</li>
<li>двигатель привода дисков;</li>
<li>печатная плата со схемами управления;</li>
<li>кабели и разъемы;</li>
<li>элементы конфигурации (перемычки и переключатели). </li>
</ul>
<p align="justify"></p>
<p align="justify"><img src="337.jpg" border="0"></p>
<p align="justify">Диски, двигатель привода дисков, головки и механизм привода головок обычно размещаются в герметичном корпусе, который называется HDA (Head Disk Assembly — блок головок и дисков). Обычно этот блок рассматривается как единый узел; его почти никогда не вскрывают. Прочие узлы, не входящие в блок HDA (печатная плата, лицевая панель, элементы конфигурации и монтажные детали), являются съемными.</p>
<div class="item-separator"></div>
</div>
<span class="row-separator"></span>
</div>
<div class="items-row cols-1 row-3">
<div class="item column-1">
<h2>

Характеристики 
</h2>

<p align="justify">Если вы решили купить новый накопитель или просто хотите разобраться, каковы различия между устройствами разных семейств, сравните их параметры. Ниже приведены критерии, по которым обычно оценивается качество жестких дисков:</p>
<ul>
<li>Ёмкостьмкость;</li>
<li>Быстродействие; </li>
<li>Надежность;</li>
<li>Стоимость.</li>

<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.3.php"> Назад</a></p></p>
</font>
</html>