<html>
<meta charset="utf-8">
<font size="5">
<title> Оценка конфигурации компьютера. </title>
<h3 align="center">Оценка конфигурации компьютера.</h3>


<p align="justify">Оценка даётся, для понятия общей картины производительности вашего ПК, что бы вы знали примерные его возможности. Пришли вы например в магазин, покупать компьютер и что бы вам не говорили, проверить всё можно посмотрев на оценку производительности компьютера. Это во первых, а во вторых, по оценке, вы можете выбрать такой системник, какой вам нужен. Например, если вы хотите играть в трёхмерные игры и смотреть фильмы в цифровом формате без тормозов, ваша оценка должна быть не ниже 5.0. Если компьютер нужен вам для работы с офисными приложениями и выхода в интернет, оценка 3.0-4.0, вас вполне устроит.&nbsp;<br />
	Имейте в виду, что более низкая оценка менее 3.0 сделает вашу работу на компьютере невыносимой, дело в том что интерфейс Aero накладывает на быстродействие Windows 7 значительную нагрузку и вам его придётся просто отключить. <br />
	Другой случай, системный блок у нас уже есть, решили мы на него установить Windows 7 и сразу после инсталляции получили <b>оценку производительности компьютера</b> и растерялись, у кого она больше, у кого меньше и задумались, по каким же критериям Windows 7 оценивает наш компьютер, а вот по каким.</p>
<ol>
	<li>Количество ядер процессора. </li>
	<li>Объём оперативной памяти</li>
	<li>Объём памяти видеокарты</li>
	<li>Интерфейс обмена данными жёсткого диска. Если SATA, оценка будет больше.</li>
</ol>
<p align="justify">Возможности вышеприведённых комплектующих, позволяют Windows 7 произвести оценку вашего компьютера, но как ни странно, даётся она всегда, по самому низко-производительному устройству. К примеру возьмём с вами мой ноутбук (иллюстрация ниже), видите операционная система присвоила ему оценку 5.0, только из-за видеоадаптера.&nbsp;<br />
	Как улучшить оценку производительности компьютера? Берём системный блок, прямо в нашем торговом зале, он не игрового типа, со слабой видеокартой и общую оценку, Windows 7 так же присвоила ему по маломощному устройству. Если я сейчас поменяю видеоадаптер на более сильный, изменится и оценка. Если вы апгрейдили свой компьютер, то есть заменили какую-то низко-производительную комплектующую на более мощную и хотите проверить изменилась ли оценка, сделать это можно так. Пуск->Панель управления->Система и безопасность->Система-> Индекс производительности Windows-><b>Повторить оценку</b>, естественно она изменится на более высокую. Оценка производительности ноутбука.</p>
<div style="text-align: center;"><img src="1321122630_-12_210829.jpg" border="0" alt="" /></div>
<p align="justify">Системный блок с низко производительной видеокартой, заменяем её и повторяем оценку, она должна быть выше.</p>
<div style="text-align: center;"><img src="1321122795_23.jpg" border="0" alt="" />
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.4.php"> Назад</a></p></p>
</font>
</html>