<html>
<meta charset="utf-8">
<font size="5">
<title> Оптические приводы и флэш карты. </title>
<h3 align="center">Оптические приводы и флэш карты.</h3>

<center><a href="/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:CDRom.png" class="image"><img alt="" src="/220px-CDRom.png" width="220" height="237" > </a></center>
 
<p align="justify"><b>Привод оптических дисков</b>  — электромеханическое устройство для считывания и (в большинстве современных моделей) записи, посредством лазера, информации с оптических дисков в виде пластикового диска с отверстием в центре (компакт-диск, DVD и т. п.).
</p><p align="justify">Разработанный компаниями Philips и Sony в конце 1970-х первоначально для чтения компакт-дисков, для абстрагирования от формата и типа диска, в обиходе называется обобщающим названием <i>дисковод</i>, по принципу чтения информации с носителя.
</p><p align="justify">Сам по себе оптический привод может быть в виде составляющей конструкции в составе более сложного оборудования (например, бытового DVD-проигрывателя) либо выпускаться в виде независимого устройства со стандартным интерфейсом подключения (PATA, SATA, USB), например, для установки в компьютер.
</p>
<p align="justify">Существуют следующие типы приводов:
</p>
<ul><li> привод CD-ROM — самый простой вид cd-привода, предназначенный только для чтения cd-дисков.</li>
<li> привод CD-RW — такой же, как и предыдущий, но способен записывать только на CD-R/RW-диски.</li>
<li> привод DVD-ROM— предназначение его состоит только в чтении DVD-дисков.</li>
<li> привод DVD/CD-RW — тот же DVD-ROM, но способный записывать на CD-R/RW-диски (комбо-привод).</li>
<li> привод DVD-RW — привод, способный не только читать DVD-диски, но и записывать на них.</li>
<li> привод DVD-RW DL — в отличие от предыдущего типа DVD RW, способен также записывать на двухслойные оптические DVD-носители, отличающиеся от обычных большей ёмкостью.</li>
<li> привод Blu-Ray (BD-ROM). Это усовершенствованная технология оптических носителей, в основе которой лежит использование лазера с длиной волны 405 нм (синий спектр излучения). Уменьшение длины волны лазера позволило сузить ширину дорожки в два раза по сравнению с DVD-диском и увеличить плотность записи данных. Уменьшение толщины защитного слоя в шесть раз повысило надежность операций чтения/записи на нескольких записываемых слоях. Диски предназначены, большей частью, для записи цифрового видео высокого разрешения. Например, на односторонний однослойный диск записывают до 2 часов видео в формате HDTV (телевидения высокой четкости) при скорости видеопотока до 54 Мбит/с.</li>
<li> привод BD-RE способен читать/записывать на диски формата Blu-Ray. </li>
<li> привод HD DVD — это новое поколение оптических дисков, которые предназначены в первую очередь для хранения фильмов высокого разрешения (HDTV). Новый формат носителей позволяет записывать в три раза больший объём данных, по сравнению с DVD. Однослойные HD DVD-диски имеют ёмкость 15 Гб, двухслойные — 30 Гб. Как правило, HD DVD-привод может читать все форматы DVD и CD-дисков.</li>
<li> привод HD DVD-ROM — привод, читающий диски формата HD DVD. Формат закрыт в феврале 2008 года.</li>
<li> привод HD DVD/DVD-RW — в отличие от предыдущего, способен записывать на диски таких форматов, как DVD-R, DVD+R, DVD-RW, DVD+RW, CD-R, CD-RW.</li>
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.3.php"> Назад</a></p></p>
</font>
</html>