<html>
<meta charset="utf-8">
<font size="5">
<title> Периферийные устройства. </title>
<h3 align="center">Периферийные устройства</h3>
<p class="block">Периферийным устройством называется Аппаратное обеспечение компьютера, которое конструктивно отделено от самого ПК, но, в то же время, функционирует под его управлением. Предназначаются такие устройства для расширения функциональности персонального компьютера: организации ввода-вывода, распечатки набранных текстов и изображений, обмена данными с другими персональными компьютерами, для управления разнообразными внешними устройствами, включая бытовую технику.</p>
<img class="photo" src="printer_1.jpg" height="369" width="590" alt="Принтер" />
<p align="justify">Это периферийное устройство предназначено для вывода на печать различной текстовой и графической информации: фотографий, рисунков, набранных текстов, графиков, чертежей и т. п.</p>
<p align="justify">По возможности отображения цвета подразделяются на:</p>
<ol>
<li><i><strong>Цветные</strong> с возможностью печати не только цветных картинок, но и полноценных фотографий (фотопринтеры);</i></li>
<li><i><strong>Чёрно-белые</strong>, печатающие простые тексты и графику с оттенками серого цвета, но без возможности вывода цвета.</i></li>
</ol>

<p align="justify">Конструктивно, существующие на сегодняшний день печатающие устройства можно разделить на:</p>
<ul>
<li><strong>Матричные</strong>, где печатающая головка содержит «иголки» удар которых, через красящую ленту по бумаге и формирует знаки и изображение. Разрешение таких принтеров может достигать 300 точек на дюйм (dpi), а количество иголок в головке 9 и 24 штуки. <strong>Недостаток</strong> – невысокая скорость печати и повышенный шум, но при этом у таких устройств самая низкая стоимость отпечатка и возможность печати через копирку;</li>
<li><strong>Струйные</strong>, само название которых, говорит само за себя – печать осуществляется за счёт управляемой струйки чернил при помощи сопел в печатающей головке. Струйные принтеры выпускаются как чёрно-белые, так и цветные, причём цветные струйные принтеры отлично подходят для печати фотографий благодаря высокому разрешению (600-900 dpi) и отличным характеристикам цветопередачи. Скорость печати достигает 10-20 страниц в минуту.<br/> <strong>Основным недостатком</strong> таких устройств является тот факт, что, если принтером долго не пользоваться, то печатающая головка быстро приходит в негодность (забиваются сопла), причём стоимость её замены сравнима со стоимостью принтера;</li>
<li><strong>Лазерные</strong> где формирование изображение на бумаге происходит методом ксерографии. Изображение переносится на бумагу при помощи лазерного луча и специального порошка, который засыпается в специальный картридж. Характеризуются лазерные принтеры высоким разрешением (до 1200 dpi для чёрно-белых и до 2400 для цветных), высокой скоростью печати (до 60 страниц в минуту), достаточно низкой стоимостью отпечатка, простотой обслуживания и содержания (они не «засыхают», как струйные), возможностью цветной печати в цветных моделях этих устройств. Благодаря тому, что в последнее годы стоимость этих устройств значительно снизилась, они все чаще применяются и простыми пользователями в домашних условиях.</li>
</ul>
<p class="block2">Первый в мире матричный принтер был выпущен в 1964 году. Но использовался он вначале не в компьютерных системах, а для распечатки показаний точного времени ⌚ в конструкции часов компании Seiko.<br/> </p>


<a id="Plotter"></a>
<br/><h2>Плоттер</h2>
<img class="photo" src="plotter_1.jpg" height="369" width="590" alt="Плоттер" />
<p align="justify">Это устройство хотя практически и не распространено у домашних пользователей ПК, но оказывается весьма ценным для тех, кто постоянно работает с чертежами или рисунками больших форматов. Подобно принтеру, <strong>плоттер способен выводить на бумагу выполненные на компьютере изображения – чертежи и рисунки очень больших форматов</strong> (вплоть до формата «А0»). Такими устройствами снабжаются конструкторские и архитектурные бюро, они незаменимы при печати больших, демонстрационных диаграмм, схем и рисунков для различных презентаций.</p>
<p align="justify">Первые модели плоттера отличались от принтера тем, что они не смешивали цвета – конструктивно они чертили заправленными каждый своим цветом «рапидографами». Можно было подбирать толщину линий, но вот цвет всегда оставался одним из установленного в плоттере набора. Сегодня, последние модели полностью лишены этого недостатка.</p>

<a id="Skaner"></a>
<br/><h2>Сканер</h2>
<img class="photo" src="scan_1.jpg" height="369" width="590" alt="Сканер" />
<p align="justify">Как и принтер, сканер является на сегодняшний день одним из самых популярных устройств, практически у всех пользователей ПК, как офисных и производственных, так и домашних. Предназначен он для сканирования (снятия визуальной копии) любых изображений и сохранения их в цифровом виде на каком-либо носителе для хранения данных. Сегодняшние сканеры, пройдя путь от медленных и примитивных устройств, сегодня являются образцом производственных технологий и научных достижений.</p>
<p align="justify">Большинство моделей имеют впечатляющие технические характеристики, которые определяют качество получаемых копий:</p>
<ul>
<li><strong>Оптическое разрешение</strong>. Одна из важнейших характеристик, напрямую отвечающая за качество получающегося при сканировании изображения. У современных моделей эта величина может достигать значения 11 000 точек на дюйм. Правда не стоит гоняться за такими параметрами и выкладывать «лишние деньги», если, например, для качественной печати на лазерном принтере потребуется лишь 100-200 dpi и 96 dpi при выводе на монитор;</li>
<li><strong>Скорость сканирования</strong>. Также немаловажная величина, позволяющая значительно экономить время при обработке большого количества изображений. Существуют модели, у которых эта величина достигает до 80 страниц в минуту! Обычно этот показатель колеблется в пределах от 1 до 3;</li>
<li><strong>Динамический диапазон сканера</strong>. Имеет значения по логарифмической шкале от 0 до 4-х. При этом значение «0» характеризует абсолютную прозрачность, а «4» - абсолютно чёрную поверхность. Для получения качественного изображения фотографий и других плоских рисунков необходима плотность равная 2. Если же необходимо получить профессиональный результат, эта величина должна иметь значения не менее 3.2;</li>
<li><strong>Оптическая плотность</strong>. Величина, характеризующая возможность сканера различать градации яркости. С теоретической точки зрения 12-ти разрядный сканер способен различить больше градаций яркости, на практике же это не всегда бывает так. Можно ориентироваться на показатель профессиональных устройств, который равен 3 и выше единицам;</li>
<li><strong>Глубина цвета</strong>. Это показатель, который говорит о том, сколько оттенков цветов может различить эта модель сканера. На сегодняшний день существуют устройства, имеющие этот показатель равным - 24, 30 и 36 бит/пиксель. Для сравнения, 24 бита вполне достаточно, чтобы различать 16.7 миллиона цветов. Интересный факт, человеческий глаз не в состоянии различить 24-х и 32-х битные изображения.</li>
</ul>
<p align="justify">Конструктивно, все сканеры делятся на:</p>
<ol>
<li><i><strong>Ручные</strong>. Изображение сканируется при проведении по нему сканером;</i></li>
<li><i><strong>Планшетные</strong>. Отлично подходят для домашнего и офисного использования при сканировании как фотографий, так и любых, других типов изображений;</i></li>
<li><i><strong>Листопротяжные</strong>. Сканирование осуществляется при протягивании листа через специальное считывающее устройство. По параметрам схожи со сканерами планшетного типа;</i></li>
<li><i><strong>Барабанные</strong>, применяются исключительно в полиграфических целях, так как обладают высокопрофессиональными параметрами и очень дороги.</i></li>
</ol>


<a id="MFU"></a>
<br/><h2>МФУ – многофункциональные устройства</h2>
<img class="photo" src="mfu_1.jpg" height="369" width="590" alt="МФУ – многофункциональные устройства" />

<p align="justify">Сегодня данные устройства очень популярны у офисных и домашних пользователей ПК, так как <strong>это периферийное устройство представляет собой два (а в большинстве случаев) три устройства «в одном флаконе» — принтер, сканер и копир</strong>. Конечно, это очень удобно – на столе сильно экономится место, да и стоимость такого агрегата значительно ниже суммы этих двух или трёх устройств.</p>
<p class="block2">Параметры МФУ идентичны параметрам входящим в его состав отдельным устройствам, поэтому при выборе такого агрегата следует ориентироваться последовательно именно на них, то есть оценить технические характеристики печатающего устройства (принтера), входящего в состав МФУ, а затем сканера и уже после этого принимать решение. Иногда подобные устройства могут обладать отличными данными для сканера, но в то же время средненькими параметрами печати.</p>



<a id="Ustrojstva_zvukovosproizvedenija"></a>
<br/><h2>Устройства звуковоспроизведения</h2>
<img class="photo" src="as_1.jpg" height="369" width="590" alt="Устройства звуковоспроизведения" />
<p align="justify">Уже много лет все производитель материнских плат включают в их состав звуковую карту. То есть практически все ПК способны воспроизводить звуковые и музыкальные файлы, прослушивать музыку и смотреть видеофильмы со звуком. Кроме этого, как правило, на материнской плате имеются и звуковые входы для подключения внешних устройств – микрофона, магнитофона, внешнего CD и DVD проигрывателя, других звуковоспроизводящих устройств.</p>
<p align="justify">Для того, чтобы в полной мере использовать данную техническую возможность необходимо для воспроизведения звука иметь либо активную акустическую систему, либо наушники. Активная акустическая система представляет собой пару акустических излучателей (колонок) со встроенным или внешним усилителем звука.</p>
<p align="justify"><strong>Большинство современных моделей имеют встроенный усилитель прямо в корпусе одной из колонок</strong>, что с одной стороны удобно – экономиться рабочее пространство, с другой стороны, такая конструкция, конечно, имеет достаточно посредственные характеристики звучания перед высококачественными моделями, у которых усилитель, как правило, всегда внешний. Но следует чётко понимать, что встроенный в материнскую плату «штатный» звуковой кодек также не блещет выдающимися параметрами, поэтому в большинстве случаев применение подобных акустических систем вполне оправданно.</p>
<p class="block2">Для более-менее качественного звуковоспроизведения при помощи штатной звуковой карты следует подбирать акустику, имеющую две (а лучше три) частотные полосы и мощность не менее 15-20 Ватт. При этом речь идёт не о громком прослушивании звука, хотя чем больше звуковая мощность акустической системы, те, конечно, громче ваши колонки будут звучать, речь идёт о запасе мощности у вашей акустики для более качественного воспроизведения звука даже при прослушивании на минимальных громкостях. Конечно, можно приобрести и такие колонки, которые вроде бы и имеют «приличную» выходную мощность, но в то же время качество звучания оставляет желать лучшего.</p>
<p align="justify">Если же акустической системой предполагается пользоваться самым минимальным образом, (например,  для проведения конференций в Интернете через «Скайп», работы с приложениями и т. п.) то, конечно, в целях экономии можно купить и небольшую пару колонок, имеющую, лишь одну, широкую полосу воспроизведения. В этом случае можно также задуматься о приобретении наушников, причём в комплекте с микрофоном.</p>
<p align="justify">При выборе наушников следует обратить внимание как минимум на три основных параметра:</p>
<ol>
<li><i><strong>Диапазон воспроизводимых частот</strong>, который должен быть не хуже от 20 Гц до 20 кГц;</i></li>
<li><i><strong>Активное сопротивление</strong>, значение которого должно находиться в пределах от 16 до 32 Ом. При меньшем сопротивлении, громкость звука выше, но, следует иметь в виду, что усилитель должен быть рассчитан на низкое сопротивление;</i></li>
<li><i><strong>Чувствительность</strong>. Этот показатель напрямую определяет громкость звука и должен быть не хуже 98-100 дБ, в противном случае, портативные устройства, не имеющие мощного звукового выхода, просто не смогут их «раскачать» и звук будет тихим.</i></li>
</ol>
<img class="photo" src="nauschniki.jpg" height="369" width="590" alt="Наушники" />
<p class="block2">Всегда обращайте внимание на материал амбушюр – они непосредственно прилегают к ушам, и от этого будет зависеть насколько комфортно вам будет при прослушивании, особенно в течении длительного времени.</p>
<p align="justify">Микрофоны для записи или передачи голоса также доступны для приобретения в отдельном порядке. Моделей существует большое множество – от настольных, до имеющих крепление на монитор.</p>
<img class="photo" src="micr_1.jpg" height="369" width="590" alt="Микрофон" />

<p class="block2">Если использование микрофона предполагается только для проведения конференций и разговоров по сети, то имеет смысл приобрести веб-камеру, которая имеет в своём составе кроме самой камеры, ещё и встроенный микрофон. В этом случае можно сэкономить не только на рабочем пространстве возле монитора, но и денежные средства.</p>


<a id="WEB-kamera"></a>
<br/><h2>WEB-камера</h2>
<img class="photo" src="webcam_1.jpg" height="369" width="590" alt="WEB-камера" />
<p align="justify">Одно из популярных ныне периферийных устройств, предназначенное для ввода видеоданных в ПК и последующей их обработки – сохранения, передачи и т. д. </p>
<p align="justify">Основные параметры, определяющие качество этого устройства:</p>
<ul>
<li><strong>Разрешение</strong>. Определяется в пикселях. Чем выше разрешение устройства, тем качественнее картинка будет получаться при вводе в ПК. Неплохим разрешением может считаться размер 640х480, дорогие модели имеют значение этого показателя – 1024х960 и выше;</li>
<li><strong>Чувствительность матрицы</strong>. Очень важный параметр, который характеризует возможность выдавать качественное изображение при низком уровне освещения. Справедливости ради следует заметить, что даже самые дорогие модели тоже имеют помехи при съёмке в плохо освещённых местах;</li>
<li><strong>Количество кадров в секунду (fps)</strong>. Чем больше этот параметр, тем чётче изображение, особенно если производится съёмка быстроизменяющихся сцен. Хорошим параметром считается значение от 30 кадров и выше.</li>
</ul>
<p align="justify">Большинство последних моделей веб-камер имеют в качестве дополнительных функций наличие встроенного микрофона, автофокус, подсветку. При этом аудиоданные передаются по тому же интерфейсу, что и видеоданные, что очень удобно – уменьшается количество соединений с ПК, освобождается микрофонный вход, который можно использовать для подключения профессионального микрофона в случае необходимости.</p>
<p align="justify">Подключается веб-камера к ПК через USB-порт, при этом для получения качественного изображения, версия USB-порта должны быть не ниже 2.0.</p>



<a id="Modem"></a>
<br/><h2>Модем</h2>
<img class="photo" src="adsl_1.jpg" height="369" width="590" alt="Модем вид сзади" />
<img class="photo" src="adsl_12.jpg" height="369" width="590" alt="Модем вид спереди" />

<p align="justify">Модемы уже много лет используются пользователями персональных компьютеров для выхода в интернет. Раньше подключение шло посредством Dial-Up модемов, скорость связи через которые, как и качество оставляло желать лучшего. Реальная скорость передачи данных, как правило, не превышала 33.6 кБит/сек., а постоянные разрывы затрудняли передачу или приём файлов большого объёма. Телефонная линия при этом также была занята.</p>
<p align="justify">Появление хDSL-технологии, в корне изменила преставления о передачи данных через медную пару, позволив пользователям осуществлять надёжное соединение на скоростях до 24 МБит/сек. в сторону абонента и до 1 Мбит/сек от него. Реализуется это при помощи такого периферийного устройства - типового ADSL модема.</p>
<p align="justify">При этом использование телефонного номера можно осуществлять одновременно с работой ПК через модем. Появилась возможность приёма и передачи файлов большого размера, проведения видеоконференций в реальном времени, осуществления групповой видеотрансляции широкому кругу пользователей (цифровое телевидение).</p>
<p align="justify">Подключается такое устройство к персональному компьютеру посредством Ethernet или USB-порта.</p>
<p class="block2"></p>


<a id="Igrovye_manipuljatory"></a>
<br/><h2>Игровые манипуляторы</h2>
<img class="photo" src="djo_2.jpg" height="369" width="590" alt="Руль-педали" />

<p align="justify">К устройствам компьютерной периферии относятся и игровые манипуляторы – джойстики, игровые комплекты – «руль-педали», и другие приспособления.</p>
<p align="justify">Подключаются они к порту USB ПК и предназначены для имитации реальных приборов управления в игровых приложениях.</p>


<a id="Svetovoe_pero"></a>
<br/><h2>«Световое перо»</h2>
<img class="photo" src="pen_1.jpg" height="369" width="590" alt="Световое перо" />
<p align="justify">Устройство выполняется в виде обычного карандаша или ручки, которая удобно ложится в руку и связана с ПК проводным или беспроводным способом. Она в точности копирует все движения пользователя по специальному коврику или экрану монитора, позволяя, таким образом, выполнять рисунок привычным способом – рисуя. Кроме этого, <strong>«световое перо» может с успехом играть и роль манипулятора наподобие компьютерной «мыши»</strong>.</p>
<p align="justify">Для сравнения, манипулятор «мышь» не позволяет выполнить рисунок традиционным образом, так как его движения трудно координировать. Световое перо полностью лишено этого недостатка.</p>
<p align="justify">Сегодня это устройство постепенно потеряло свою актуальность, так как появление тачпадов – панелей чувствительных к прикосновениям, сделали возможным делать то же самое, но уже без специальных устройств, подключаемых к ПК. Компьютерные рисунки же, оказалось удобнее выполнять на другом устройстве – «дигитайзере».</p>


<a id="Digitajzer"></a>
<br/><h2>Дигитайзер</h2>
<img class="photo" src="dig_1.jpg" height="369" width="590" alt="Дигитайзер" />
<p align="justify">Представляет собой графический планшет, подключаемый к персональному компьютеру и предназначенный для ввода графических данных, которые пользователь пишет или рисует на его поверхности.</p>
<p class="block2">Удобство дигитайзера состоит в том, что изображение видно не только на большом экране монитора, но и на самом планшете, то есть создаётся впечатление, что пользователь выполняет действия на листе бумаге.</p>
<p align="justify">Большая точность современных моделей и удобство пользования, обеспечила этим устройством большую популярность у создателей анимационной графики – создателей современных мультфильмов, компьютерных игр, архитекторов и дизайнеров, компьютерных художников.</p>














<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="2.1.php"> Вернуться к темам</a> </br></br>
<a href="vnesh.php"> Назад</a></p></p>
</font>
</html>