<html>
<meta charset="utf-8">
<font size="5">
<title> Программная совместимость. </title>
<h3 align="center">Программная совместимость.</h3>

<p align="justify">Программная совместимость - возможность выполнения одних и тех же программ на разных ЭВМ с получением одинаковых результатов.</p>
  <p align="justify">Совместимость компьютеров определяют, как правило, по отношению к компьютерам IBM AT. Как уже было сказано, первые ПК класса IBM AT создавались из уже широко представленных на компьютерном рынке элементов. Любой инженер, имеющий представление о структуре вычислительной системы, может без труда из таких &quot;покупных&quot; деталей собрать свой собственный ПК, подобный IBM AT. Единственным запатентованным фирмой IBM компонентом является набор из двух микросхем, названный BIOS (базовая система ввода- вывода). Именно записанный в этих схемах код лежит в основе совместимости.</p>
  <p align="justify">В настоящее время программная совместимость уже не является камнем преткновения. Наборы BIOS даже самых малоизвестных фирм обеспечивают совместимость с компьютерами фирмы IBM. Разработчики программного обеспечения, стремясь расширить использование своей продукции, обязательно должны учитывать</p>
  <p align="justify">программную совместимость с компьютерами фирмы IBM.</p>
  <p align="justify">Аппаратная совместимость. Этот термин относится к системам, допускающим сопряжение, или устройствам с взаимозаменяемыми конструктивными узлами. Употребляют его и в случае, когда речь идет о модулях расширения. Некоторые из них, такие как платы памяти или видеоадаптер, не могут работать с набором BIOS некоторых ПК. В этом случае либо применяют другой набор BIOS, либо заменяют плату расширения.</p>
  <p align="justify">Однако современные производители аппаратуры, стараясь заполучить как можно больше покупателей, стремятся во что бы то ни стало обеспечить аппаратную совместимость своей продукции с выпускаемыми изделиями.</p>
  <p align="justify">Совместимость внутри одного пакета программ. Иногда случается так, что программы одного и того же программного обеспечения не могут вместе &quot;сосуществовать&quot; независимо от типа компьютера. Наиболее часто такие &quot;конфликты&quot; возникают между резидентными программами. Такая несовместимость не оказывает влияния на работу самого ПК, нарушается лишь выполнение программ.</p><noindex><center><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
  <p align="justify">Совместимость плат расширения. Иногда несовместимыми могут оказаться платы расширения. При этом не нарушается работа всего компьютера. Такая несовместимость связана лишь с невозможностью одновременной работы двух или более плат. В этом случае необходимо заменить одну из них.</p>
  <p align="justify">Скоростная совместимость. Выполнение некоторых программ возможно лишь при определенной скорости. В случае запуска таких программ на более быстром компьютере их выполнение нарушается. Исправить подобное положение можно либо переключением на более низкую скорость, либо использованием сервисных программ, вызывающих снижение скорости работы.</p>

  
 
 
 
 
 
 
 
 <p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.5.php"> Назад</a></p></p>
</font>
</html>