
<html>
<meta charset="utf-8">
<font size="5">
<title> Сетевые фильтры и источники бесперебойного питания. </title>
<h3 align="center">Сетевые фильтры и источники бесперебойного питания.</h3>

<p align="justify"><strong>Сетевой фильтр</strong> – выглядит как удлинитель, у которого несколько розеток и один или несколько выключателей. Основное его назначение – сглаживать (фильтровать) помехи и скачки напряжения.</p>
<div id="attachment_315" style="width: 310px" class="wp-caption aligncenter"><a href="http://it-uroki.ru/wp-content/uploads/2012/02/filtr-1.jpg" data-rel="lightbox-gallery-KvTH" title=""><img class="size-medium wp-image-315" title="Внешний вид сетевого фильтра" src="http://it-uroki.ru/wp-content/uploads/2012/02/filtr-1-300x187.jpg" alt="Внешний вид сетевого фильтра" width="300" height="187" srcset="http://it-uroki.ru/wp-content/uploads/2012/02/filtr-1-300x187.jpg 300w, http://it-uroki.ru/wp-content/uploads/2012/02/filtr-1-560x349.jpg 560w, http://it-uroki.ru/wp-content/uploads/2012/02/filtr-1.jpg 640w" sizes="(max-width: 300px) 100vw, 300px" /></a><p class="wp-caption-text">Внешний вид сетевого фильтра</p></div>
<h3>Выбор сетевого фильтра</h3>
<p align="justify">Стоимость сетевого фильтра указанного на фотографии &#8212; около 4$ (30 грн./100 р.). Немного лучшую защиту дают модели чуть дороже – от 6$, уже хорошую защиту – от 12$, а наилучшую защиту – модели от 20$.</p>
<p align="justify">При покупке обратите внимание на характеристики сетевого фильтра:</p>
<ul>
<li>длину кабеля (1,8 м / 3 м / 5 метров);</li>
<li>ток импульсной помехи, выдерживаемый ограничителем (от 3500 А до 10 000 А);</li>
<li>максимальный ток (не менее 10 А);</li>
<li>количество и тип розеток.</li>
</ul>
<p align="justify">Как и при покупке любого другого устройства, экономия должна быть в разумных пределах. Самые дешевые модели, по сути, простые удлинители с выключателями, а функции фильтрации в них минимальны или вообще отсутствуют. Делайте выводы.</p>
<h2>ИБП &#8212; Источник Бесперебойного Питания</h2>
<p align="justify"><strong>Источник бесперебойного питания</strong> (<strong>ИБП</strong>, англ. UPS) – не только отфильтровывает помехи, но и поддерживает работу компьютера при отключении электроэнергии, что позволит сохранить нужные документы и правильно завершить работу (выключить компьютер). Внутри ИБП находится аккумулятор, которого хватит на 10-20 минут работы.</p>
<div id="attachment_316" style="width: 310px" class="wp-caption aligncenter"><a href="http://it-uroki.ru/wp-content/uploads/2012/02/ups-1.jpg" data-rel="lightbox-gallery-KvTH" title=""><img class="size-medium wp-image-316" title="Внешний вид источника бесперебойного питания" src="http://it-uroki.ru/wp-content/uploads/2012/02/ups-1-300x300.jpg" alt="Внешний вид источника бесперебойного питания" width="300" height="300" srcset="http://it-uroki.ru/wp-content/uploads/2012/02/ups-1-300x300.jpg 300w, http://it-uroki.ru/wp-content/uploads/2012/02/ups-1-560x560.jpg 560w, http://it-uroki.ru/wp-content/uploads/2012/02/ups-1.jpg 640w" sizes="(max-width: 300px) 100vw, 300px" /></a><p class="wp-caption-text">Внешний вид источника бесперебойного питания (ИБП) (сайт it-uroki.ru)</p></div>
<p align="justify">ИБП пригодится, если от кондиционера соседей у Вас <strong>периодически мигает свет</strong>, или теплые полы так и норовят <strong>вырубить автомат</strong>. В этом случае «бесперебойник» (разговорное название ИБП) позволит сохранить Ваш компьютер и данные на нём в целости и сохранности. Вообще покупка источника бесперебойного питания очень актуальна, если учитывать качество электроснабжения в относительно старых квартирах.</p>
<h3>Принцип работы ИБП</h3>
<p align="justify">На рисунке ниже наглядно описан принцип работы ИБП:</p>
<div id="attachment_317" style="width: 310px" class="wp-caption aligncenter"><a href="http://it-uroki.ru/wp-content/uploads/2012/02/ups-1.png" data-rel="lightbox-gallery-KvTH" title=""><img class="size-medium wp-image-317" title="Схема работы источника бесперебойного питания (резервного типа)" src="http://it-uroki.ru/wp-content/uploads/2012/02/ups-1-300x257.png" alt="Схема работы источника бесперебойного питания (резервного типа)" width="300" height="257" srcset="http://it-uroki.ru/wp-content/uploads/2012/02/ups-1-300x257.png 300w, http://it-uroki.ru/wp-content/uploads/2012/02/ups-1-560x479.png 560w, http://it-uroki.ru/wp-content/uploads/2012/02/ups-1.png 720w" sizes="(max-width: 300px) 100vw, 300px" /></a><p class="wp-caption-text">Схема работы источника бесперебойного питания (резервного типа)</p></div>
<ul>
<li>При нормальном напряжении в сети компьютер работает от розетки (через встроенный фильтр и стабилизатор).</li>
<li>При проблемах с электропитанием (слишком большое или низкое напряжение или оно вообще отсутствует) подключается батарея, находящаяся внутри «бесперебойника» и компьютер питается от неё.</li>
</ul>
<h3>Покупать или не покупать?</h3>
<p align="justify">ИБП стоит заметно дороже сетевого фильтра (от 50 $), поэтому нужно оценить необходимость его использования. Если у Вас не мигает свет, и отключения происходят крайне редко, то можно обойтись и сетевым фильтром. <h3>Выбор ИБП</h3>
<p align="justify">В первую очередь следует обратить внимание на следующие характеристики:</p>
<ul>
<li>Максимальная мощность, измеряется в вольт-амперах «VA» и ваттах «W» (выбор зависит от мощности компьютера и монитора, чем они больше, тем больше должны быть цифры у ИБП);</li>
<li>Время работы от батареи при полной и половинной нагрузке (неплохие показатели 5 и 15 минут);</li>
<li>Диапазон входных напряжений (в каких пределах будет справляться ИБП без использования батареи, желательно 180-250 Вольт или шире);</li>
<li>Количество и тип розеток для подключения устройств (могут быть обычные «евро-розетки», а могут быть специальные компьютерные).</li>
</ul>
<div id="attachment_318" style="width: 249px" class="wp-caption aligncenter"><a href="http://it-uroki.ru/wp-content/uploads/2012/02/ups-2.jpg" data-rel="lightbox-gallery-KvTH" title=""><img class="size-medium wp-image-318" title="На задней панели ИБП видны «компьютерные» розетки" src="http://it-uroki.ru/wp-content/uploads/2012/02/ups-2-239x300.jpg" alt="На задней панели ИБП видны «компьютерные» розетки" width="239" height="300" /></a><p class="wp-caption-text">На задней панели ИБП видны «компьютерные» розетки</p></div>
<p align="justify">При покупке ИБП лучше не экономить, иначе потом придется регулярно доплачивать (на слишком частую замену аккумулятора или ремонт), а кому этого захочется?</p>
<p align="justify">При выборе источника бесперебойного питания можно следовать простому правилу: <strong>не покупать дешевле 90$</strong>.</p>
<p style="padding-left: 30px;"><em><p align="justify">Начиная от 150-200$, идут еще более надежные модели, которые и работают по более совершенному принципу, но эта цена уже доступна не каждому.</p>
<h3>Совместимость ИБП и блока питания компьютера</h3>
<p align="justify">Перед покупкой ИБП следует знать один важный момент, о котором не часто говорят:</p>
<blockquote><p align="justify">
<strong>Некоторые блоки питания компьютера некорректно работают с ИБП! </strong><br />
Уточнить можно у продавца, сообщив модель блока питания.
</p></blockquote>
<p align="justify">В одном из последующих IT-уроков (но уже на более высоком уровне подготовке) мы рассмотрим, почему это так и как избежать этой проблемы. Если вопрос не терпит, то обращайтесь в комментариях к этой статье, постараюсь помочь.</p>
<h2>Подключение сетевого фильтра и ИБП</h2>
<p align="justify">Подключение довольно простое:</p>
<ol>
<li>В сетевой фильтр или ИБП включается шнур питания системного блока, монитора и других внешних устройств (сканер, принтер и т.д.).</li>
<li>Вилка шнура самого фильтра или ИБП подключается в розетку домашней электрической сети.</li>
</ol>
<p align="justify">Если Вы используете ИБП, то сетевой фильтр подключать не обязательно, разве что для увеличения количества розеток или в качестве удлинителя.</p>


<p align="justify"><strong>Примечание: </strong>лазерный принтер нельзя подключать к ИБП, так как у него слишком большая мощность, часто для него предусмотрена специальная розетка, которая не питается батареей, но имеет фильтр от помех (на последней фотографии в статье такая розетка окрашена белым цветом).</p>


















<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.6.php"> Назад</a></p></p>
</font>
</html>