<html>
<meta charset="utf-8">
<font size="5">
<title> Ручные сканеры штрих-коды. </title>
<h3 align="center">Ручные сканеры штрих-коды</h3>
<img typeof="foaf:Image" src="http://www.scanermarket.ru/sites/default/files/styles/thumbnail_170/public/ruchnye_skanery_shtrikh_kodov.jpg?itok=m7PMxo50" width="170" height="155" alt="Ручные сканеры штрих кодов" />
<p align= "justify">Ручной сканер штрих кода - самый распространенный тип сканеров, использующихся в сфере розничной торговли. Ручные сканеры завоевали свою популярность благодаря удобству и мобильности, которую они обеспечивают. Мобильный сканер штрих кода широко используется на кассах и складах магазинов. Для считывания информации необходимо поднести сканер к штрих-коду и нажать на кнопку. Мобильный сканер штрих кодов, может быть проводным или беспроводным. Проводные сканеры, как правило, снабжены интерфейсами RS-232, USB или PS/2 для подключения к компьютеру. Беспроводные сканеры могут быть оборудованы инфракрасным портом, либо технологиями Bluetooth или Wi Fi. Переносной сканер штрих кода (беспроводной) обеспечивает максимальную мобильность работы, поэтому он будет незаменим в процессе инвентаризации или проверки ценников в торговом зале.</p>
<p align= "justify">Ручные сканеры могут различаться по типу считываемых штрих-кодов: линейные или двумерные. По типу сканирующего элемента сканеры бывают лазерными, светодиодными или имидж сканерами (фотосканеры). Портативные сканеры штрих кодов - особый вид ручных сканеров, отличающийся компактными размерами и малым весом.</p>










<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="2.1.php"> Вернуться к темам</a> </br></br>
<a href="2.3.php"> Назад</a></p></p>
</font>
</html>