<html>
<meta charset="utf-8">
<font size="5">
<title> Общие понятия совместимости. </title>
<h3 align="center">Общие понятия совместимости.</h3>

<p align="justify">Совместимость (compatibility) — способность аппаратных или программных средств работать с компьютерной системой. Аппаратная (техническая) совместимость ( hardware (equipment) compatibility) — способность одного компьютера работать с узлами или устройствами, входящими в состав другого компьютера. Составной частью аппаратной совместимости является электромагнитная совместимость (ЭМС) (ElectroMagnetic Compatibility, EMC) — способность работающих (в том числе, автономно друг от друга) технических средств не создавать взаимных электромагнитных помех, а также функционировать при наличии внешних электромагнитных полей. Также ЭМС называют ограничение собственного электромагнитного излучения устройств до уровня, не влияющего на работу других устройств.</p>
  <p align="justify">Информационная совместимость (data compatibility) — способность двух или более компьютеров или систем адекватно воспринимать одинаково представленные данные. Частью информационной совместимости, а также средством ее обеспечения является совместимость форматов представления данных. Программная совместимость (software compatibility) — возможность выполнения одних и тех же программ на разных компьютерах с получением одинаковых результатов (не путать с совместимостью программ).</p>
  <p align="justify">Совместимость программ (program compatibility) — пригодность программ к взаимодействию друг с другом и, в частности, к объединению в программные комплексы для решения более сложных задач, например, в автоматизированных системах. Полная совместимость (fully compatibility) — аппаратная, программная и информационная совместимость двух или более компьютеров без каких-либо ограничений для их пользователей.</p>
  <p align="justify">По аппаратной совместимости различают так называемые аппаратные платформы. В области персональных компьютеров сегодня наиболее широко распространены две аппаратные платформы — IBM РС и Аррlе Macintosh. Кроме них существуют и другие платформы, распространенность которых ограничивается отдельными регионами или отдельными отраслями. Принадлежность компьютеров к одной аппаратной платформе повышает совместимость между ними, а принадлежность к разным платформам — понижает.</p>
  <p align="justify">Кроме аппаратной совместимости существуют и другие виды совместимости: совместимость на уровне операционной системы, программная совместимость, совместимость на уровне данных.</p>
  <p align="justify">Аппаратная совместимость: а) комплектующие, удовлетворяющие одному стандарту,</p>
  <p align="justify">являются взаимозаменяемыми; б) различные части компьютера не конфликтуют между собой.</p>
  <p align="justify">Программная совместимость: программы, разработанные на одной машине, будут правильно работать и на другой. Для проверки программной совместимости в начале 90 годов рекомендовалось использование компьютерных игр, например, DOOM.</p>
<p align="justify">Существует два основных варианта решения проблемы совместимости компьютерных платформ:</p>
  <p align="justify">•  <b>Аппаратные решения</b> - это специальные платы, несущие на себе дополнительные процессор, оперативную память и видеопамять другой аппаратной платформы. Фактически они представляют собой отдельный компьютер, вставленный в существующий ПК. Его, как и обычный компьютер, можно оснастить любой операционной системой по выбору пользователя и соответствующим программным обеспечением. При этом можно легко переключаться между двумя операционными системами, обмениваться между ними файлами и выполнять другие операции, причем производительность обеих систем остается высокой и они не влияют друг на друга, так как практически не имеют разделяемых ресурсов, кроме мыши, клавиатуры и монитора. Основным недостатком таких плат является их высокая стоимость, хотя и несколько меньшая, чем отдельного ПК.</p>
  <p align="justify">•  <b>Программные решения</b> - это специально написанные программы-эмуляторы, позволяющие запустить программное обеспечение, разработанное для персональных компьютеров одного типа, на другом ПК. <b>Эмулятор -</b> специальная программа, выполняющая каждую команду исходной программы посредством одной или нескольких команд ПК, на котором происходит эмуляция.</p>

  <p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.5.php"> Назад</a></p></p>
</font>
</html>