<html>
<meta charset="utf-8">
<font size="5">
<title> Структура базового микропроцессора. </title>
<h3 align="center">Структура базового микропроцессора.</h3>
<p align="justify">
Основу
центрального процессора ПЭВМ составляет
микропроцессор -обрабатывающее
устройство, служащее для арифметических
и логических преобразований данных,
для организации обращения к ОП и ВнУ и
для управления ходом вычислительного
процесса. В настоящее время существует
большое число разновидностей
микропроцессоров, различающихся
назначении, функциональными возможностями,
структурой, исполнением. Чаще всего
наиболее существенным, классификационным
различием между ними является количество
разрядов в обрабатываемой информационной
единице:8-битовые, 16-битовые, 32-битовые
и др. </p><p align="justify">
Современные
процессоры выполняются в виде
микропроцессоров. Физически микропроцессор
представляет собой интегральную схему
— тонкую пластинку кристаллического
кремния прямоугольной формы площадью
всего несколько квадратных миллиметров,
на которой размещены схемы, реализующие
все функции процессора. Кристалл-пластинка
обычно помещается в пластмассовый или
керамический плоский корпус и соединяется
золотыми проводками с металлическими
штырьками, чтобы его можно было
присоединить к системной плате компьютера.</p><p align="justify">
В
вычислительной системе может быть
несколько параллельно работающих
процессоров; такие системы называются
многопроцессорными.</p><p align="justify">
Первый
микропроцессор был выпущен в 1971 г фирмой
Intel (США) - МП 4004 В настоящее время
выпускается несколько сотен различных
микропроцессоров, но наиболее популярными
и распространенными являются
микропроцессоры фирмы Intel и AMD. </p>
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="2.1tem.php"> Назад</a></p></p>
</font>
</html>