<html>
<meta charset="utf-8">
<font size="5">
<title> Системный блок и блок питания. Система охлаждения. </title>
<h3 align="center">Системный блок и блок питания. Система охлаждения.</h3>

<p align="justify"><strong>Системный блок</strong>, если говорить утрировано, представляет собой шасси, в котором <strong>объединены все аппаратные компоненты обеспечивающие работу компьютера</strong>.</p>
<div id="attachment_10313" style="width: 470px" class="wp-caption aligncenter"><img src="siis_block.jpg" alt="Системный блок" width="460" height="490" class="size-full wp-image-10313" srcset="http://vchemraznica.ru/wp-content/uploads/2017/02/siis_block-282x300.jpg 282w, http://vchemraznica.ru/wp-content/uploads/2017/02/siis_block.jpg 460w" sizes="(max-width: 460px) 100vw, 460px" /><p class="wp-caption-text">Системный блок</p></div>
<p align="justify">На него возложены функции создания вычислительной техники с дальнейшей возможностью расширение вычислительной системы.</p>
<p align="justify">Содержимое каждого системного блока может различаться, чаще всего начинка зависит от функциональных задач, которые планируется реализовывать с помощью этой техники. Но основными составляющими системного блока являются:</p>
<ul>
<li>Вычислительный блок, который объединяет материнскую плату, центральный процессор, расположенный на ней.</li>
<li>Звуковая, сетевая и видео карта, которые крепятся к материнской плате специальными крепежными элементами.</li>
<li>Винчестер, монтаж которого проводится благодаря специальному шлейфу.</li>
<li>Планки оперативной памяти, которые помогают обеспечить быструю работу устройства.</li>
<li>Блок питания.</li>
</ul>
<p align="justify">Конструкция системного блока подразумевает наличие разъемов и выходов для присоединения к нему различных первичных устройств и необходимых для работы компонентов компьютера. Обязательно в комплектации персонального компьютера кроме самого системника входят мышка, клавиатура и монитор.</p>
<p align="justify">Также внутри системного блока, по желанию пользователя, могут располагаться приводы для чтения информации с различных носителей и прочие периферийные устройства, которые нужны для качественной работы.</p>
<p align="justify"><img src="vnut66.jpg" alt="Внутри системного блока" width="660" height="490" class="aligncenter size-full wp-image-10314" srcset="http://vchemraznica.ru/wp-content/uploads/2017/02/vnut66-300x223.jpg 300w, http://vchemraznica.ru/wp-content/uploads/2017/02/vnut66.jpg 660w" sizes="(max-width: 660px) 100vw, 660px" /></p>
<p align="justify">По своей сути, системный блок – это <strong>коробка, в которой объединены все наиболее важные элементы</strong>, что отвечают за работу всего устройства в целом.</p>
<p align="justify">Фронтальная панель корпуса дополнительно имеет функциональные элементы:</p>
<ul>
<li>Кнопки включения и выключения.</li>
<li>Различные индикаторы состояния, например, питания.</li>
<li>Гнезда для подключения наушников, микрофона и колонок.</li>
<li>Интерфейсы, что отвечают за передачу данных, например, USB, FireWire.</li>
</ul>
<p align="justify">Как стало понятно, что в принципе сравнивать процессор и системный блок вообще нет смысла – этой совершенно разные вещи. Их объединяет одно – они используются для создания высокоскоростной производительной вычислительной системы.</p>

</br></br>
<p align="justify"><strong><img src="blok-p.jpg" alt="блок питания компьютера" title="Блок питания компьютера" width="128" height="128" hspace="15" vspace="4" align="left" />Блок питания компьютера</strong> – это механическое или электронное  устройство. </p>
  <p align="justify">Блок питания формирует напряжение, получаемое от электрической  сети, которое необходимо различным типам аппаратуры.</p>
 <p align="justify">
В Российской Федерации переменный ток 
  


электросети 220 В  частотой 50 Гц, преобразуется в нужное количество постоянного тока. В иных же  странах используются другие напряжения и частоты.</p>

 <p align="justify">
  Для примера сейчас рассмотрим <em>трансформаторный блок питания</em>,  <span class="smotri">признанный «классическим»</span>. Такой блок питания включает в себя понижающий трансформатор,  выпрямителя, который преобразует переменный ток в постоянный. После  выпрямителей, для сглаживания пульсации тока, устанавливается специальный  фильтр – это конденсатор большой емкости. </p>
 <p align="justify">Иногда используются другие схемы трансформаторных  блоков питания, например, это может быть применение выпрямителей с двойным  напряжением, стабилизаторы тока, фильтры высокочастотных помех и другое. </p>
 <p align="justify">
  Главное преимущество трансформаторного <strong>блока питания</strong> – это его  простота, надежность, низкая стоимость и высокая доступность элементов – легкий  ремонт и замена деталей. </p>
 <p align="justify">
  Недостатками трансформаторных блоков, являются – большой вес,  невысокий коэффициент полезного действия и высокое содержание металлов. </p>
 <p align="justify">
  <strong>Трансформаторные блоки питания</strong> очень часто сравнивают с  импульсными. Импульсные блоки питания имеют небольшой вес и обладают  стабильностью и гарантируют бесперебойную и долгую работу. Такие блоки питания  чаще всего используются на складах, фабриках, цехах и т.д.</p>

</br></br>
 <div class="page-header">
		<h2 itemprop="name">
							Системы охлаждения компьютера					</h2>
							</div>
 
<p align="justify">Компьютер - это устройство, cсостоящие из электронных компонентов, которые являются проводниками. При прохождении  по ним электрического тока выделяется тепло. Об этом нам говорит физический закон.
</p>

<p align="justify"><img src="system-holod-1.jpg" width="400px" alt="Произведение народных умельцев" title="Система охлаждения" />
</p>

 
<p align="justify">Греется компьютер неравномерно - некоторые части нагреваются сильно, какие-то остаются холодными. И все бы хорошо, только разогрев радиоэлементов до высокой температуры не очень полезен и может стать причиной выхода их из строя. Именно поэтому были придуманы системы охлаждения компьютера.
</p>


<p align="justify">В те далеки времена, когда люди ездили на лошадиных повозках, а мужики носили лапти о системах охлаждения никто не думал, они просто были не нужны. Другое дело сейчас, в настоящее время системы охлаждения активно развиваются. Как охладить компьютер? Этим вопросом задаются многие фирмы и просто рядовые пользователи. Кто просто думает, ну а кто изучает проблему детально и своими руками мастерит новые конструкции. Такие исследования порой обходятся не дешево, например, в пару сгоревших системных блоков. Но что сделаешь? Это издержки.
</p>

<p align="justify">Народ у нас талантливый, изобретательный. Глядишь на новую разработку очередного умельца и думаешь: "А что? Неплохо придумано. И старый холодильник "Апшерон" пригодился. "
</p>


<p align="justify">Итак, системы охлаждения разделяют на пассивные и активные.
</p>

<p align="justify">Пассивные - без движущих механизмов и питания.
</p>



<p align="justify"><h3>1.Радиаторы</h3>
</p>

<img src="system-holod-2.jpg" class="pull-right" alt="Пассивная система охлаждения" title="Радиатор" />

<p align="justify">И снова, здравствуй, физика. Существует такой вид теплового обмена, как теплопередача. Радиатор при контакте с греющимся элементом забирает часть тепла, нагреваясь сам. Соответственно, чем больше радиатор, тем больше он забирает тепла. Также большую роль играет теплопроводность материала, из которого изготовлен радиатор. Наибольшей теплопроводностью из металлов обладает алюминий, еще лучший показатель у меди и самым теплопроводным металлом считается серебро. Однако, исходя из стоимости металлов  можно сделать вывод, что радиаторы из серебра будут не всем по карману.
</p>

<p align="justify">Радиаторы, используются самостоятельно, так и в комплексе с воздушным видом охлаждения (вентиляторами), или с другими видами.
</p>

<p align="justify">Неплохим дополнением к радиатору является герметичная трубка, заполненная жидкостью, но не полностью, а лишь частично. Эта трубка соединяет между собой два радиатора. Один из радиаторов нагревается и жидкость начинает испаряться с этой части трубки, нагревая равномерно всю трубку.  Пар конденсируется на другом (холодном конце) трубки. Таким образом, теплообмен происходит более быстро. 
</p>

<p align="justify">Преимущества пассивных систем: 
</br>-бесшумность
</br>-надежность
</br>-безопасность 
</p>

<p align="justify">Недостатки:
</br>-низкая эффективность
</p>

<p align="justify"><h3>2. Воздушные системы</h3></p>

<img src="system-holod-3.jpg" alt="Кулер с подсветкой" class="pull-left" title="Система охаждения" />
<p align="justify">
Это наиболее распространенный вид охлаждения. Используется воздушное охлаждение, часто вместе с радиаторами. В системном блоке необходимо правильно организовать воздушный поток, таким образом, чтобы горячий воздух выдувался из блока, а холодный поступал в блок и охлаждал наиболее греющиеся устройства: процессор, видеокарту, жесткий диск, оперативную память и др. 
</p>

<p align="justify">Воздушную систему улучшают: увеличевая скорости вращения кулеров, увеличением диаметра  вентиляторов  и наращиванием их количества. В корпусах обычно закладывают специальные посадочные места для дополнительных кулеров.
Одной из важных характеристик является также уровень шума. Тихим считается кулер с шумом в 15 - 20 дБ. Естественно, чем больше кулеров и чем быстрее их скорость, тем выше уровень шума. Более высокоэффективные кулеры, как правило, более шумные. 
</p>

<p align="justify"> Вентиляторы также могут быть оснащены светодиодной подсветкой разных цветов. 
</p>

<p align="justify">Преимущества: 
</br>-высокая эффективность
</br>-надежность
</br>-безопасность 
</p>

<p align="justify">Недостатки:
</br>-высокий уровень шума
</p>

<p align="justify"><h3>3.Жидкостные системы</h3></p>

<img src="system-holod-4.gif" alt="Схема жидкостной системы" class="pull-right" title="Жидкостная система" />

<p align="justify">Не так давно жидкостная система была новшеством на рынке систем охлаждения, однако сейчас она твердо заняла свое место. 
</p>

<p align="justify">Жидкости являются лучшим проводником тепла, чем воздухом, поэтому жидкостные системы более эффективные.
Основными элементами жидкостной системы охлаждения являются теплообменник, который передает тепло от нагреваемого элемента жидкости. После этого жидкость по средствам трубок доставляется в радиатор, в котором проходит процесс охлаждения жидкости.  Для того,  чтобы жидкость циркулировал по системе используется насос. Помпа постоянно гоняет воду по системе, иначе эффективность системы упадет в разы.  Насосы бывают двух видов: погружаемые - должны находится в резервуаре, заполненном жидкостью и наружные. Если используется погружаемый насос, то необходимо к нему изготовить резервуар или купить готовый.
</p>

<p align="justify">Также оснащаются светодиодной подсветкой, что придает дизайну компьютера особый вид.
</p>

<p align="justify">Преимущества: 
</br>-высокая эффективность
</br>-низкий уровень шума
</br>-небольшие габариты теплообменников
</p>

<p align="justify">Недостатки:
</br>-опасность при разгерметизации системы
</br>-высокая стоимость
</br>-неадаптированность любого корпуса к такой системе
</p>

<p align="justify"><h3>4. Погружные системы охлаждения</h3></p>
<p align="justify">
<img src="system-holod-5.jpg" alt="Погружная система" title="Погружная система" />
</p>
<p align="justify">Одной из новых систем охлаждения, которая пока еще не находится в серийном производстве. 
Идея такова : "Если жидкость лучший проводник тепла, чем воздух, то необходимо компьютер погрузить в  жидкость полностью ."
</p>

<p align="justify">Для реализации такой идеи необходимо изготовить аквариум для компьютера, установить там материнскую карту, видеокарту, так чтобы к ним можно было подключится с внешней стороны резервуара. После сборки компьютера, залить  в аквариум жидкость, которая не проводит электрический ток. 
</p>

<p align="justify">Преимущества: 
</br>-высокая эффективность
</br>-низкий уровень шума
</p>

<p align="justify">Недостатки:
</br>-опасность залить все вокруг маслом при разгерметизации аквариума
</br>-большие габариты данной системы
</br>-неудобство при замене устройств в компьютере
</p>

<p align="justify"><h3>5. Экстремальные системы охлаждения</h3>
</p>

<p align="justify">
<img src="system-holod-6.jpg" alt="Экстремальная система охлаждения" title="Экстремальная система охлаждения" />
</p>
<p align="justify">Используются любителями, занимающимися разгоном процессора (при разгоне очень сильно греется процессор). Рядовым пользователям такие системы конечно ни к чему. Тут используются криогенные камеры, охлаждение азотом, охлаждение с применением фреона и другие методы. 
</p>  

  
  
  
  
  
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.3.php"> Назад</a></p></p>
</font>
</html>