<html>
<meta charset="utf-8">
<font size="5">
<title> Системная шина. </title>
<h3 align="center">Системная шина.</h3>

<p align="justify"><strong>Системная шина (FSB)</strong> – канал, по которому процессор соединен с другими устройствами компьютера.</p>
<p align="justify"">К шине напрямую подключен только процессор, другие устройства компьютера подключены к ней через разнообразные контроллеры. Центральный процессор через <strong>Системную шину (FSB) </strong>подключается к системному контроллеру (Северный Мост или<strong> North Bridge</strong>). Северный мост оснащен контроллером ОЗУ (или же этот контроллер встроен в центральный процессор), а также контроллеры шин для подключения периферийных устройств.</p>


<p align="justify">Также к системному контроллеру подключают периферийные устройства с высокой производительностью – видеокарта с шиной <strong>PCI Express 16x</strong>, а устройства с меньшой производительностью (устройства с шиной PCI или микросхема BIOS) будут подключены уже к Южному Мосту (<strong>South Bridge</strong>), который, через специальную шину, подключен к северному мосту. Набор из северного и южного мостов называют <strong>чипсетом</strong>.</p>

<p align="justify">Несложно сделать вывод, что чем выше частота шины, тем выше производительность, а значит, повышается скорость обмена данными между материнской платой и процессором. При выборе процессора и материнской платы следует обращать внимание на частоты их шин. Желательно чтобы они совпадали. Если частота шины процессора выше частоты материнской платы, то процессор работать не будет.</p>

<center><p><img class="aligncenter size-full wp-image-53" title="устройство компьютера" alt="системная шина" src="FSB-системная-шина.jpg" width="368" height="237" /></p></center>
<p align="justify">Но если, к примеру, у процессора частота шины 1066 МГц, а материнская плата поддерживает процессоры с частотой 1333 МГц, то процессор будет работать, но только она своих 1066 МГц.</p>
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.3.php"> Назад</a></p></p>
</font>
</html>