<html>
<meta charset="utf-8">
<font size="5">
<title> Устройство ввода/вывода. </title>
<h3 align="center">Устройство ввода/вывода</h3>

<p align="justify"><span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);"><i>Устройства ввода и вывода</i></span>&nbsp; - устройства взаимодействия компьютера с внешним&nbsp; миром: с пользователями или другими компьютерами. Устройства ввода позволяют вводить информацию в компьютер для дальнейшего хранения и обработки, а устройства вывода - получать информацию из компьютера. <br /></p><p align="justify">Устройства ввода и вывода относятся к периферийным (дополнительным) устройствам. <span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);"><i><br /></i></span></p><p align="justify"><span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);"><i><a name="perif" class="mceItemAnchor"></a>Периферийные устройства</i></span> - это все устройства компьютера, за исключением процессора и внутренней памяти.</p><p align="justify">Классификация периферийных устройств по месту расположения (относительного системного блока настольного компьютера или корпуса ноутбука):</p><ul><li>внутренние - находятся внутри системного блока\корпуса ноутбука: жесткий диск (винчестер), встроенный дисковод (привод дисков);<br /></li><li>внешние - подключаются к компьютеру через порты ввода-вывода: мышь, принтер и т.д.<br /></li></ul><p align="justify">По другому определению, <span style="background-color: #ffff99;" mce_style="background-color: #ffff99;"><i>периферийными устройствами</i></span> называют устройства, не входящие в системный блок компьютера.</p><p align="justify">Устройства ввода и вывода разделяются на:</p><ul><li>устройства ввода,</li><li>устройства вывода,</li><li>устройства ввода-вывода.<br /></li></ul><p align="justify"><span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);">Устройства ввода данных</span><i><span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);"><br /></span></i></p><p align="justify">Классификация по типу вводимой информации:</p><ul><li>устройства ввода текста: клавиатура;</li><li>устройства ввода графической информации:
<ul>
<li>сканер,</li> 
<li>цифровые фото- и видеокамера,</li>
<li>веб камера - цифровая фото- или видеокамера маленького размера, которая делает фото или записывает видео в реальном времени для дальнейшей их передачи по сети Интернет;<br /></li> 
<li>графический планшет (дигитайзер) - для ввода чертежей, графиков и планов с помощью специального карандаша, которым водят по экрану планшета;</li>
</ul></li>
<li>устройства ввода звука: микрофон;</li></ul><p align="justify">Устройства-манипуляторы (преобразуют движение руки в управляющую информацию для компьютера):</p>
<ul><li>несенсорные: 
<ul><li>мышь,</li>
<li>трекбол - устройство в виде шарика, управляется вращением рукой;</li> 
<li>трекпойнт (Pointing stick) - джойстик очень маленького размера (5 мм) с шершавой вершиной, который расположен между клавишами клавиатуры, управляется нажатием пальца; </li>
<li>игровые манипуляторы: джойстик, педаль, руль, танцевальная платформа, игровой пульт (геймпад, джойпад);
</li></ul></li>
<li>сенсорные: 
<ul>
<li>тачпад (сенсорный коврик) - прямоугольная площадка с двумя кнопками, управляется движением пальца и нажатием на кнопки, используется в ноутбуках,</li> 
<li>сенсорный экран - экран, который реагирует на прикосновение пальца или стилуса (палочка со специальным наконечником), используется в планшетных персональных компьютерах;<br /></li> 
<li>графический планшет (дигитайзер) - для ввода чертежей, схем и планов с помощью специального карандаша, которым водят по экрану планшета,<br /></li> 
<li>световое перо - устройство в виде ручки, ввод данных приконовением или проведением линий по экрану ЭЛТ-монитора (монитора на основе электронно-лучевой трубки). Сейчас световое перо не используется.</li></ul></li>
</ul><p align="justify"><span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);">Устройства вывода данных</span></p>
<p align="justify">Классификация по типу выводимой информации:</p>
<ul><li>устройства вывода графической и текстовой информации:
<ul><li>монитор - для вывода на дисплей (экран монитора),</li>
<li>проектор - для вывода на большой экран,</li>
<li>устройства для вывода на печать:
<ul><li>принтер - для вывода информации на бумагу, а также на поверхность дисков;</li> 
<li>широкоформатный принтер ("широкий" принтер) - для вывода на листах форматов:&nbsp; А0, А1, А2 и А3,</li> 
<li>плоттер (графопостроитель) - для вывода векторных изображений (различных чертежей и схем)&nbsp; на бумаге, картоне, кальке;</li> 
<li>каттер (режущий плоттер) - вырезает изображения из пленки, картона по заданному контуру;<br /></li>
</ul></li>
</ul>
</li><li>устройства вывода (воспроизведения) звука : 
<ul>
<li>наушники, </li>
<li>колонки и акустические системы (динамик, усилитель), </li>
<li>встроенный динамик (<span lang="en">PC speaker; Beeper</span>) - для подачи звукового сигнала в случае возникновения ошибки.</li></ul></li></ul><p align="justify"><span mce_style="background-color: #ffff99;" style="background-color: rgb(255, 255, 153);">Устройства ввода-вывода:</span></p><ul><li>жесткий диск (винчестер) (входящий в него дисковод) - для ввода-вывода информации на жесткие пластины жесткого диска;<br /></li><li>флэшка (флешка или USB-флеш-накопитель) - для ввода-вывода информации на микросхему памяти флэшки<br /></li><li>дисководод оптических дисков - для ввода-вывода информации на оптические диски,&nbsp;</li><li>дисководод гибких дисков - для ввода-вывода информации на дискеты,</li><li>стример - для ввода-вывода информации на картриджи (ленточные носители);<br /></li><li>кардридер - для ввода-вывода информации на карту памяти;</li><li>многофункциональное устройство (МФУ) - копировальный аппарат с дополнительными функциями принтера (вывод данных) и сканера (ввод данных)<br /></li><li>модем (телефонный) - для связи компьютеров через телефонную сеть;<br /></li><li>сетевая плата (сетевая карта или сетвой адаптер) - для подключения персонального компьютера к сети и организации взаимодействия с другими устройствами сети (обмен информацией по сети).</li></ul>











<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="2.1.php"> Вернуться к темам</a> </br></br>
<a href="vnesh.php"> Назад</a></p></p>
</font>
</html>