<html>
<meta charset="utf-8">
<font size="5">
<title> Устройства телекоммуникации. </title>
<h3 align="center">Устройства телекоммуникации</h3>


<p align="justify"><strong>Устройства связи и телекоммуникации</strong><i> </i>используются для связи с приборами и другими средствами автоматизации (согласователи интерфейсов, адаптеры, цифро-аналоговые и аналого-цифровые преобразователи и т.п.) и для подключения ПК к каналам связи, к другим ЭВМ и вычислительным сетям (сетевые интерфейсные платы, &quot;стыки&quot;, мультиплексоры передачи данных, модемы).</p>
 <p align="justify">Сетевой <strong>адаптер</strong><i> </i>является внешним интерфейсом ПК и служит для подключения его к каналу связи для обмена информацией с другими ЭВМ, для работы в составе вычислительной сети. В глобальных сетях функции сетевого адаптера выполняет модулятор-демодулятор (модем).</p>
 <p align="justify">Многие из названных выше устройств относятся к условно выделенной группе - средствам мультимедиа.</p>
 <p align="justify"><strong>Средства мультимедиа</strong>(multimedia - многосредовость) - это комплекс аппаратных и программных средств, позволяющих человеку общаться компьютером<strong>,</strong>используя самые разные, естественные доя себя среды: звук, видео, графику, тексты, анимацию и др.</p>
 <p align="justify">К средствам мультимедиа относятся:</p>
 <p align="justify">v устройства речевого ввода и вывода информации широко распространенные уже сейчас сканеры (поскольку они позволяют автоматически вводить в компьютер печатные тексты и рисунки);</p>
 <p align="justify">v высококачественные видео- (video) и звуковые (sound-) платы, платы видеозахвата (videograbber), снимающие изображения с видеомагнитофона или видеокамеры и вводящие его в ПК;</p>
 <p align="justify">v высококачественные акустические и видеовоспроизводящие системы с усилителями, звуковыми колонками, большими видеоэкранами. Но, пожалуй, еще с большим основанием к средствам<i> </i>мультимедиа<i> </i>относят<i> </i>внешние запоминающие устройства большой емкости на оптических дисках, часто используемые для записи звуковой и видеоинформации.</p>
 <p align="justify">Стоимость компактных дисков (CD) при их массовом тиражировании невысокая, а, учитывая их большую емкость (650 Мбайт, а новых типов - 1Гбайт и выше), высокие надежность и долговечность, стоимость хранения данных является несравнимо меньшей, нежели на магнитных дисках. Это уже привело к тому, что большинство программных средств самого разного назначения поставляется на CD. На компакт-дисках за рубежом организуются обширные базы данных, целые библиотеки; на CD<i> </i>представлены словари, справочники, энциклопедии, обучающие и<i> </i>развивающие программы по общеобразовательным и специальным предметам.</p>
 <p align="justify">CD широко используются, например, при изучении иностранных языков<i>, </i>правил<i> </i>дорожного движения, бухгалтерского учета, законодательства вообще и налогового законодательства в частности. И все это сопровождается текстами и рисунками, речевой информацией и мультипликацией, музыкой и видео. В чисто бытовом аспекте CD можно использовать для храненияаудио - и видеозаписей, т.е. использовать вместо плеерных. видеокассет и видеокассет. Следует упомянуть, конечно, и о большом количестве программ компьютерных игр, хранимых на CD.</p>









<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="2.1.php"> Вернуться к темам</a> </br></br>
<a href="vnesh.php"> Назад</a></p></p>
</font>
</html>