<html>
<meta charset="utf-8">
<font size="5">
<title> Звуковая карта. </title>
<h3 align="center">Звуковая карта.</h3>
<center> <img src="sound-card-logo.jpg"> </img></center>

<p align="justify"><strong>Звуковая карта</strong> - это плата расширения или интегрированный чипсет (кодек) для создания звука на компьютере, который можно услышать через громкоговорители или наушники, или записи при помощи микрофона.</p>
<p align="justify">К альтернативным названиям относятся: устройство вывода звука, звуковая плата, аудиоплата или аудиоустройство и другие, реже встречающиеся названия.</p>
<h2>Как это работает?</h2>
<p align="justify"><img src="audio-chip.jpg" alt="Чипсет звуковой карты" width="400" height="379" style="display: block; margin: 5px auto;" title="Чипсет звуковой карты" /></p>
<p align="justify">Большинство звуковых карт используют ЦАП (цифро-аналоговый преобразователь) для преобразования цифровых аудиосигналов в аналоговые. Сигнал выводится на привычные наушники и другие акустические устройства. Более продвинутые карты, могут включать более одного звукового чипа для поддержки высоких скоростей данных и выполнения нескольких одновременно выполняемых функций.</p>
<h2>Где находится звуковая карта?</h2>
<p align="justify">Независимо от того, что компьютеру не нужно звуковое устройство для его функционирования, звуковые карты включены для удобства пользователя в большинстве ПК либо в слот расширения, интегрированы в материнскую плату, либо подключаются через внешние порты.</p>
<p align="justify"><img src="vihodi-integrirovannoy-zvukovoy-karti.jpg" alt="Разъёмы интегрированной звуковой карты" width="600" height="353" style="display: block; margin: 5px auto;" title="Разъёмы интегрированной звуковой карты" /></p>
<p align="justify">Интегрирование звуковой карты в материнскую плату, позволяет удешевить сборки, по сравнению с платой расширения и с незаметной для обыкновенного пользователя потерей качества звука. Отдельные звуковые карты, как показывает практика, необходимы лишь для серьёзного аудио профессионала или использования при выходе из строя интегрированной.</p>
<p align="justify"><img src="zadnaya-panel-zvukovoy-karti.jpg" alt="Задняя аудиопанель системного блока" width="400" height="587" style="display: block; margin: 5px auto;" title="Задняя аудиопанель системного блока" /></p>
<p align="justify">Установка звуковой карты производится в разъёмы на современной материнской плате PCI или PCIe. Типичная карта имеет интерфейс, доступ к которому можно получить на задней панели с различными портами вывода и ввода звука, а также в зависимости от строения компьютерного корпуса, портами для ввода и вывода аудио, находящимися по бокам корпуса или даже в верхней его части.</p>
<p align="justify"><img src="audio-vihodi-nettop.jpg" alt="Звуковые выход и вход в неттопе" style="display: block; margin: 5px auto;" title="Звуковые выход и вход в неттопе" /></p>
<p align="justify">Для компьютеров, апгрейд которых обычно закачивается увеличением объёма оперативной памяти или же заменой жёсткого диска на твердотельный накопитель ноутбуки, моноблоки, неттопы существует возможность использовать внешнее звуковое устройство, выполняющее функцию звуковой карты, обычно подключаемое к компьютеру через USB порты.</p>
<p align="justify"><img src="usb-sound-card.jpg" alt="Внешняя USB звуковая карта" width="500" height="319" style="display: block; margin: 5px auto;" title="Внешняя USB звуковая карта" /></p>
<h2>Драйверы и ПО</h2>
<p align="justify">Как правило, звуковая карта или звуковой чип, в случае с интегрированным аудио, поставляются с фирменным программным обеспечением на диске или же их можно скачать на сайте производителя оборудования. Современные операционные системы без труда могут обнаруживать и загружать драйверы популярных звуковых карт.</p>
<p align="justify"><img src="programnoe-obespechenie-audio-plati.jpg" alt="Интерфейс ПО звуковой карты" width="600" height="446" style="display: block; margin: 5px auto;" title="Интерфейс ПО звуковой карты" /></p>
<p align="justify">Такое программное обеспечение способно дать пользователю возможность вносить более тонкие настройки и предоставлять инструменты записи, редактирования и т. д.</p>
</p>
<p align="center">
<a href="ntd.php"> Вернуться к разделам</a></br></br>
<a href="1.1.php"> Вернуться к темам</a> </br></br>
<a href="1.3.php"> Назад</a></p></p>
</html>